[
  {
    "ticker": "ACDC",
    "company": "ProFrac Holdings",
    "segment": "Pumper / Completion Services",
    "quarter": "Q3 2025",
    "transcript_url": "InsiderMonkey full transcript",
    "strategy_summary": "ProFrac is navigating a soft North American completions market with fleet counts in the low-20s active, focused on technology differentiation through ProPilot 2.0 automation and the newly announced Seismos strategic partnership for closed-loop fracturing. A $100M cost savings program is underway alongside e-frac and dual-fuel fleet expansion.",
    "capex_guidance": "$160-190M for full-year 2025",
    "basin_focus": [
      "Permian Basin",
      "Eagle Ford",
      "Haynesville",
      "Appalachia"
    ],
    "technology_mentions": [
      "ProPilot 2.0 surface automation (up to 26% fuel economy improvement)",
      "Seismos closed-loop fracturing (CLF) strategic partnership",
      "E-frac fleets",
      "Dual-fuel fleets",
      "Real-time downhole performance auditing via Seismos"
    ],
    "completions_strategy": "ProPilot 2.0 handles surface automation while Seismos provides subsurface intelligence in two modes: supervised (real-time decision-making with operator) and unsupervised (fully automated adjustments). Seismos described as 'independent auditor for downhole performance.' Combined offering positions ProFrac for closed-loop fracturing differentiation in a commoditizing market.",
    "service_provider_mentions": [
      "Seismos (strategic partner, CLF)",
      "Halliburton (competitive context)"
    ],
    "metrics_reported": {
      "Q3_revenue": "$403M",
      "Q3_adjusted_EBITDA": "$41M",
      "active_fleet_count": "low-20s",
      "cost_savings_program": "$100M target"
    },
    "seismos_relevance": "High",
    "seismos_relevance_detail": "ProFrac explicitly names Seismos as a strategic partner and describes closed-loop fracturing capabilities in the call. Quote: 'Strategic partnership with Seismos... closed-loop fracturing capabilities that represent the next evolution in completion solutions.' Two-mode CLF (supervised and unsupervised) described. Seismos positioned as independent downhole auditor complementing ProPilot 2.0 surface automation. Machina CLF integration is the commercial offering.",
    "notable_quote": "Seismos acts as an independent auditor for downhole performance, introducing closed-loop fracturing capabilities that represent the next evolution in completion solutions."
  },
  {
    "ticker": "HAL",
    "company": "Halliburton Company",
    "segment": "OFS-Completions",
    "quarter": "Q4 2025",
    "strategy_summary": "Halliburton is leaning into completions technology differentiation through Zeus IQ (real-time automated completions platform), e-frac adoption, and international expansion. North America revenue pressure offset by technology premium and international growth.",
    "capex_guidance": "$1.6-1.8B",
    "production_guidance": "N/A",
    "basin_focus": [
      "Permian",
      "Eagle Ford",
      "Middle East",
      "Latin America"
    ],
    "technology_mentions": [
      "Zeus IQ",
      "e-frac",
      "automated completions",
      "real-time optimization",
      "iCruise",
      "Sperry Drilling"
    ],
    "completions_strategy": "Zeus IQ automated completions platform saw 8% QoQ adoption increase. Pushing real-time completions intelligence as a differentiation lever against Liberty and ProFrac.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Zeus IQ customers see 15-20% improvement in stage efficiency",
    "seismos_relevance": "High",
    "seismos_relevance_reason": "Zeus IQ is a direct competitor to Seismos CLF. 8% QoQ adoption increase signals accelerating market acceptance of real-time completions intelligence.",
    "notable_quote": "Zeus IQ represents the future of completions optimization",
    "data_quality": "Search summary"
  },
  {
    "ticker": "LBRT",
    "company": "Liberty Energy",
    "segment": "Pumper / Completion Services",
    "quarter": "Q4 2025",
    "transcript_url": "MarketBeat highlights summary",
    "strategy_summary": "Liberty Energy delivered resilient 2025 results ($4.0B revenue, $634M adj EBITDA) and is pivoting aggressively into distributed power (LPI) targeting 3 GW by 2029. Core completions business faces mid-single-digit pricing pressure in 2026 with flat revenue guidance. Technology differentiation via Atlas/Atlas IQ completions intelligence platform and digiFleet automation.",
    "capex_guidance": "~$250M completions capex in 2026; $275-350M power equipment deposits + $450-550M project capex (project-financed)",
    "basin_focus": [
      "North America broad",
      "Texas",
      "Louisiana"
    ],
    "technology_mentions": [
      "Atlas cloud-based completions data platform (deployed with every Liberty crew)",
      "Atlas IQ AI-powered assistant with natural language queries across operational data",
      "DigiFleets (electric fracturing)",
      "DigiTechnologies transition",
      "AI-driven asset optimization software",
      "Forte generation platform (distributed power)",
      "Tempo Power Quality Management System",
      "Chorus (grid solution)"
    ],
    "completions_strategy": "Continuous operations, multi-frac jobs, automation, and transparency cited as 'flight to quality' differentiators as lower-tier competition exits. Atlas IQ provides real-time operational data and AI-powered insights to completion crews. 14% reduction in maintenance costs per unit of work achieved via AI optimization. Building 3-4 additional digiFleets in 2026.",
    "service_provider_mentions": [
      "ProFrac (competitive context)",
      "Vantage Data Centers (power customer)"
    ],
    "metrics_reported": {
      "FY2025_revenue": "$4.0B",
      "FY2025_adjusted_EBITDA": "$634M",
      "FY2025_CROCI": "13%",
      "Q4_revenue": "$1.0B",
      "Q4_adjusted_EBITDA": "$158M",
      "shareholder_returns_2025": "$77M",
      "maintenance_cost_reduction": "14% per unit of work",
      "power_target_2029": "~3 GW",
      "Vantage_deal": "1 GW (400 MW firm 2027)",
      "Texas_project": "330 MW"
    },
    "seismos_relevance": "High",
    "seismos_relevance_detail": "Liberty Energy is a Seismos partner (pumping company agnostic is Seismos's pitch, but Liberty is a key channel). Atlas IQ is a direct completions intelligence platform — a competitive/complementary product to Seismos's SAFA analytics. Liberty's emphasis on real-time operational data, AI-assisted decision-making during frac jobs, and automation parallels Seismos's CLF value proposition. Liberty's pricing headwinds in 2026 create both risk (budget pressure) and opportunity (tech differentiation argument). Atlas IQ launch is the most important competitive signal to monitor.",
    "notable_quote": "Fewer crews are available to meet any incremental completions demand — a flight to quality favoring providers that can deliver multi-frac jobs, continuous operations, and automation and transparency."
  },
  {
    "ticker": "MGY",
    "company": "Magnolia Oil & Gas Corp",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "Magnolia delivered 11% production growth to ~100,000 BOE/d in 2025 with field-level cash operating costs down 7% to $5.12/BOE, generating $425M+ FCF of which ~75% was returned to shareholders. Giddings (Eagle Ford) drilling efficiency improved 8% in drilled feet per day and 6% in completed feet per day, with well costs trending toward ~$1,000/ft from ~$1,100/ft. 2026 guidance targets ~5% production growth with flat D&C capital of $440-480M, remaining completely unhedged.",
    "capex_guidance": "$440-480M D&C and facility capital 2026; ~$125M Q1 2026 (highest quarterly rate); no additional rigs planned",
    "basin_focus": "Eagle Ford / Giddings field (South Texas); company-wide South Texas focus with horizontal drilling and multi-stage completions",
    "technology_mentions": "Completion efficiency gains in Giddings: 8% improvement in drilled feet/day, 6% improvement in completed feet/day; well costs ~$1,000/ft trending down from $1,100/ft; improved well placement cited for outperformance vs type curves",
    "completions_strategy": "Multi-stage horizontal completions in Eagle Ford/Giddings; 8,000-8,500 ft typical lateral length; well cost optimization toward $1,000/ft; consistency with same rigs/crews/equipment over multi-year periods cited as key to efficiency; completion deferrals in H1 2025 enabled by strong early productivity",
    "service_provider_mentions": "Service costs described as 'flat to slightly down' for 2026; key providers locked in for H1 2026; no specific vendors named",
    "metrics_reported": "FY2025 production 100,000 BOE/d (+11%); Q4 2025 record 103,800 BOE/d; oil production ~40,000 bpd; field-level cash OpEx $5.12/BOE (-7%); D&C capital $461M; organic proved developed F&D $9.25/BOE; FCF >$425M; diluted shares -4.5%",
    "seismos_relevance": "High",
    "seismos_relevance_detail": "Magnolia is an EXISTING Seismos CLF case study customer operating in the Eagle Ford/Giddings. This earnings call confirms continued focus on completion efficiency optimization in Giddings, improved drilled and completed feet per day, and well cost reduction — all areas where Seismos CLF delivers documented value. Completion deferrals and improved well placement language aligns with CLF-driven optimization. Strong candidate for expanded engagement and case study refresh given active 2026 program with $440-480M D&C spend.",
    "notable_quote": "8% increase in drilled feet per day and 6% improvement in completed feet per day during 2025"
  },
  {
    "ticker": "OVV",
    "company": "Ovintiv",
    "segment": "E&P Operator",
    "quarter": "Q4 2025",
    "transcript_url": "InsiderMonkey full transcript",
    "strategy_summary": "Ovintiv is executing a $2.3B capital program focused on Permian and Montney after divesting Anadarko assets. Company is achieving step-change completions efficiency through continuous pumping (7-day straight runs), real-time frac optimization algorithms, and surfactant adoption (300 Permian wells, 9% oil productivity uplift). Well costs targeting <$600/ft Permian and <$500/ft Montney.",
    "capex_guidance": "$2.3B total 2026; <$600/ft Permian, <$500/ft Montney target",
    "basin_focus": [
      "Permian Basin",
      "Montney (Canada)",
      "Anadarko (divested)"
    ],
    "technology_mentions": [
      "Real-time frac optimization with proprietary algorithms",
      "Continuous pumping (7-day straight operational run achieved)",
      "Surfactants (300 Permian wells, 9% oil productivity improvement)",
      "Drive Center AI platform for drilling optimization",
      "Automated drilling (AI-driven slide/rotate optimization)",
      "Cube/reoccupation sequencing strategy"
    ],
    "completions_strategy": "Continuous pumping is a central focus — achieved 20% improvement in completed feet per day, averaging 4,250 ft/day with 7-day straight runs. Proprietary real-time frac optimization algorithms adjust treatment parameters during pumping. Surfactants credited for half of type curve improvement since 2022. Ovintiv explicitly owns its frac optimization IP internally.",
    "service_provider_mentions": [
      "Halliburton (implied, major Permian pumper)",
      "unnamed pumpers"
    ],
    "metrics_reported": {
      "FY2026_capex": "$2.3B",
      "continuous_pumping_improvement": "20% in completed ft/day",
      "avg_completed_ft_per_day": "4,250 ft/day",
      "surfactant_wells": "300 Permian wells",
      "surfactant_oil_uplift": "9%",
      "permian_well_cost_target": "<$600/ft",
      "montney_well_cost_target": "<$500/ft"
    },
    "seismos_relevance": "High",
    "seismos_relevance_detail": "Ovintiv's 'real-time frac optimization with proprietary algorithms' is the most direct competitive signal in the operator universe — they are doing in-house what Seismos sells as SAFA/CLF. This makes Ovintiv both a potential target customer (if their proprietary solution has gaps) and a competitive intelligence data point showing operator appetite for real-time optimization. The 9% oil uplift from surfactants and continuous pumping metrics also define the ROI benchmarks Seismos must meet or beat. Continuous pumping focus means any downtime (plug-and-perf issues Seismos addresses) is a high-pain point.",
    "notable_quote": "We achieved a seven-day continuous pumping run and a 20% improvement in completed feet per day, driven by real-time frac optimization using proprietary algorithms."
  },
  {
    "ticker": "PR",
    "company": "Permian Resources Corporation",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "Permian Resources is driving aggressive D&C cost reductions and completions efficiency gains through simul-frac optimization in the Delaware Basin. The company reduced D&C cost to $700/ft and targets $675/ft in 2026, while acquiring more inventory than drilled for the third consecutive year and growing production 5% with lower capex.",
    "capex_guidance": "$1.85B total ($1.45B D&C, $400M non-D&C), down $120M YoY",
    "production_guidance": "415,000 BOE/d total, 189,000 Bopd oil (5% growth)",
    "basin_focus": [
      "Delaware Basin (New Mexico - 65%)",
      "Delaware Basin (Texas - 30%)"
    ],
    "technology_mentions": [
      "simul-frac",
      "surfactants and acids on producing wells",
      "long laterals (up to 17,000 ft)"
    ],
    "completions_strategy": "Increased completed lateral feet per day by 20% YoY through simul-frac efficiency improvements. Drilling 2-mile wells in ~13 days spud-to-rig release. Average lateral length of 11,000 ft in 2026 with longest lateral at ~17,000 ft. Experimenting with surfactants and acids on existing producing wells with mixed results - some wells showing double or triple production rates.",
    "service_provider_mentions": [],
    "efficiency_metrics": "D&C cost per foot: $700 (Q4 2024) targeting $675 (2026), ~20% reduction vs 2024. Drilling feet per day up 6% YoY. Completed lateral feet per day up 20% YoY. 2-mile wells: ~13 days spud-to-rig release. LOE: $5.26/BOE, cash G&A: $0.80/BOE, GP&T: $1.18/BOE.",
    "seismos_relevance": "High",
    "seismos_relevance_reason": "Pure-play Delaware Basin operator actively pushing completions technology boundaries with simul-frac optimization and 20% YoY completion efficiency gains. Experimenting with well intervention techniques. Heavy focus on D&C cost reduction and completion speed optimization aligns directly with CLF value proposition. Scale of operations (415K BOE/d) and tech-forward culture make PR a strong Seismos prospect.",
    "notable_quote": "There is more juice to squeeze on the cost side...on the drilling side.",
    "data_quality": "Full transcript"
  },
  {
    "ticker": "PUMP",
    "company": "ProPetro Holding Corp.",
    "segment": "OFS-Pumper",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "ProPetro navigated a contracting Permian frac market (~70 active fleets vs prior 90-100) by generating strong Q4 FCF from its completions business and pivoting growth capital toward PROPWR, its power generation business targeting 1 GW by 2030. The company is investing in fleet automation technology, FORCE electric frac fleet buyouts, and direct-drive gas frac units, while maintaining pricing discipline and keeping majority of fleets under contract. PROPWR has 240 MW committed and 550 MW on order including a data center contract.",
    "capex_guidance": "2026 total CapEx $390-435M; completions $140-160M (incl. FORCE lease buyouts $40-50M); PROPWR $250-275M",
    "basin_focus": "Permian Basin exclusively (frac); national power market including data centers for PROPWR",
    "technology_mentions": "FORCE electric frac fleets (5 fleets, lease buyout in 2026-2028); Tier IV DGB fleets (7 fleets); direct-drive gas frac units (pilot, adding gradually); fleet automation technology investment; wireline (Silvertip); cementing; PROPWR (natural gas recip generators 70% / modular turbines 30% at $1.1M/MW)",
    "completions_strategy": "Maintaining ~11 active frac fleets Q1 2026 (down from Permian peak); majority under contract for stability; refurbishing Tier IV DGB fleet; adding direct-drive gas units selectively; fleet automation upgrades for customer fine-tuning and internal predictive maintenance; pricing discipline — will not run at subeconomic rates",
    "service_provider_mentions": "Caterpillar Financial Services (FORCE fleet financing, $157M facility); Stonebriar Commercial Finance ($350M leasing facility); no upstream technology vendors named",
    "metrics_reported": "Q4 revenue $290M; Q4 adjusted EBITDA $51M (18% margin, +45% QoQ); Q4 completions FCF $98M; Permian ~70 active fleets (market); PROPWR 240 MW committed, 550 MW on order, target 750 MW by end-2028 / 1 GW by 2030; equity offering raised ~$163M net",
    "seismos_relevance": "High",
    "seismos_relevance_detail": "ProPetro is a Seismos partner and key distribution channel — as one of the 'big three' Permian pumpers alongside Liberty and ProFrac. The transcript confirms ProPetro is investing heavily in fleet automation and technology to support customer frac optimization, directly complementary to SAFA/CLF. Their FORCE electric fleet and technology investment narrative aligns with Seismos positioning. Continued Permian-only focus means any CLF/SAFA deployment would go through ProPetro. Key account for partnership expansion and Machina integration.",
    "notable_quote": "Fleet automation technology investment allows customers to fine-tune completions programs at the highest level"
  },
  {
    "ticker": "TCW",
    "company": "Trican Well Service",
    "segment": "OFS - Pumper (Canada pressure pumping)",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "Trican delivered strong Q4 results (CAD $322.7M revenue, 23% EBITDA) driven by Iron Horse acquisition and a 70/30 gas/oil work mix. The company is differentiating as the only Canadian basin provider offering a 'full suite' of electric assets on location, investing CAD $40M in 100% natural gas Caterpillar 3520 frac pumpers (first units received, field deployment Q2 2026, 10-pump spread by fall), and is 'incredibly bullish' on Montney/Duvernay driven by LNG export capacity growth.",
    "capex_guidance": "CAD $120M 2026 capital program (~50% expansion including ~CAD $40M natural gas frac fleet); maintenance ~CAD $60M",
    "basin_focus": "Western Canada - Montney (dominant), Duvernay, Cardium, SAGD (Christina Lake expansion), Eastern Alberta/Saskatchewan/Central Alberta (Iron Horse acquisition)",
    "technology_mentions": "Natural gas frac pumpers (Cat 3520, 100% NG - first in fleet), electric ancillary frac equipment (full suite - only provider in basin), AI for cementing blending error reduction, hybrid cementing unit development, natural gas semi-trucks, electrification of ancillary support equipment",
    "completions_strategy": "Deep frac differentiation via natural gas pumping and full electric ancillary suite; demand for electric assets exceeds supply; trends toward longer wells and higher sand volumes; growing logistics business as customer-supplied sand increases; cementing expansion into SAGD (Christina Lake) market; coil tubing setting depth/horizontal records in Montney/Duvernay",
    "service_provider_mentions": "Caterpillar (natural gas frac pumpers - Cat 3520); Iron Horse Frac (acquired); Centrica implied (customer LNG contracts referenced)",
    "metrics_reported": "Q4 revenue: CAD $322.7M (vs CAD $275.5M prior year); EBITDA: CAD $73.4M (23% margin); FCF: CAD $46.6M; net debt: CAD $79.9M (~0.3x leverage); shares repurchased: 12.1M in FY2025; cementing Q4 revenue/jobs: +33% YoY; work mix: ~70% gas / 30% oil",
    "seismos_relevance": "High",
    "seismos_relevance_detail": "Trican is a direct target for Seismos CLF partnership in the Canadian market. As the dominant Canadian pressure pumper with strong Montney/Duvernay market position and a technology-forward posture (electric fleet, NG pumpers, AI tools), Trican is exactly the type of pumping company Seismos targets. Their active expansion into electric/NG fleets and customer demand for efficiency and lower emissions creates a natural CLF value proposition. Trican's SAGD cementing expansion into Christina Lake and emphasis on customer technology roadmaps is additional signal. No current Seismos relationship mentioned, making this a greenfield opportunity.",
    "notable_quote": "Only provider in the basin offering a full suite of electric assets on frac location"
  },
  {
    "ticker": "APA",
    "company": "APA Corporation",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "APA exceeded cost reduction targets, generating $1B+ FCF in 2025 with net debt below $4B, and expects to exit 2026 at a $450M controllable spend run-rate. The Permian is APA's foundational asset with ~450k net acres; 2026 capital of $1.3B targets flat Permian oil production at 120-122k bpd while D&C costs improved to $595/lateral foot (Midland) and $750/lateral foot (Delaware). Suriname GranMorgu targets mid-2028 first oil with $230M of 2026 capital.",
    "capex_guidance": "$1.3B U.S. 2026 capital (~$1.2B Permian D&C + $100M base capital); ~$230M Suriname GranMorgu; ~$70M exploration; total 2026 capex not explicitly stated but ~$1.6B implied",
    "basin_focus": "Permian Basin (Midland and Texas-Delaware, 450k net acres); Egypt (gas-weighted growth, 540-550 MMcfd gross gas 2026); Suriname (GranMorgu development, mid-2028 first oil)",
    "technology_mentions": "Drilling and completion cost reductions ($595/ft Midland, $750/ft Delaware); artificial lift investments; compression and facilities consolidation; no specific frac diagnostics technology mentioned",
    "completions_strategy": "D&C cost discipline with Midland at $595/lateral foot (periods under $500); Delaware at $750/ft (some under $700 shallow); 4-well appraisal test in shallow Delaware (Avalon/Bone Spring) late 2026; 2026 program holds Permian oil flat at 120-122k bpd; technical upside inventory conversion via delineation",
    "service_provider_mentions": "No specific service providers named",
    "metrics_reported": "Q4 FCF $425M; FY2025 FCF >$1B; net debt <$4B; proved reserves +9% to >1B boe; all-in RRR >160%; Permian D&C costs $595/ft Midland, $750/ft Delaware; Egypt Q4 gross gas 501 MMcfd",
    "seismos_relevance": "Medium",
    "seismos_relevance_detail": "APA is active in the Permian (Midland and Delaware) with a cost-reduction and capital-efficiency focus on completions. D&C cost reduction and technical inventory conversion suggest interest in frac performance optimization tools. However, no completions diagnostics, real-time frac monitoring, or CLF technology was mentioned. Medium relevance as a Permian operator prospect.",
    "notable_quote": "We see a clear line of sight to incremental free cash flow from Suriname beginning in 2028"
  },
  {
    "ticker": "AR",
    "company": "Antero Resources Corporation",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "Antero is pursuing aggressive production growth from 3.4 to 4.1 Bcfe/d in 2026, driven by the HG Energy acquisition that added 385,000 net acres and 400+ drilling locations. The company reduced its cost structure by ~10% and is positioning for $3+ gas pricing with flexible growth capital that can be deferred or accelerated based on market conditions.",
    "capex_guidance": "~$1B D&C capital (maintenance ~$900M, up to $200M discretionary growth)",
    "production_guidance": "4.1 Bcfe/d in 2026, targeting 4.3-4.5 Bcfe/d in 2027",
    "basin_focus": [
      "Appalachia",
      "Marcellus"
    ],
    "technology_mentions": [
      "extended lateral lengths",
      "stages per day records"
    ],
    "completions_strategy": "Record 19 stages/day on single crew in Q4 2025; company-wide average over 14 stages/day, up 8% YoY. Running 3 rigs and 2 completion crews described as most capital-efficient configuration. HG Energy acreage enables bigger pads, wider spacing, and bigger completions with better recoveries. Average lateral length increasing to 15,000 ft from 13,000 ft driven by HG acreage. Drilling days below 5 per 10,000 ft, improving 4% from 2024.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Record 19 stages/day (single crew), 14+ stages/day company-wide (up 8% YoY). Drilling days <5 per 10,000 ft (4% improvement). Cash costs reduced ~10% ($0.25 improvement). Adjusted EBITDAX $422.1M in Q4, up 27% YoY. $750M+ FCF for full year 2025.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Active completions operator setting frac efficiency records and focused on optimizing completion designs for HG Energy acreage. Emphasis on bigger completions and wider spacing. However, no specific mentions of CLF, acoustic sensing, real-time frac monitoring, or digital completions technologies.",
    "notable_quote": "We set numerous company records in 2025, including a record 19 stages per day on a single completion crew in Q4.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "BKV",
    "company": "BKV Corporation",
    "segment": "Operator - Gas (Barnett/NEPA)",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "BKV delivered 8% exit-to-exit organic production growth in its first full public year, setting internal completions efficiency records above 22 HP-hours/day and lowering D&C costs to $545/ft - peer-leading for gas. Strategy centers on a 'closed-loop' upstream/power/CCUS platform targeting hyperscaler PPAs from its 1.5 GW Temple gas plant. Barnett refracs and POW (positive offset well) production management are key differentiators.",
    "capex_guidance": "$410-$560M gross 2026 capex; $240M upstream development; $135M strategic power capital",
    "basin_focus": "Barnett Shale (Fort Worth Basin, dominant position), NE Pennsylvania",
    "technology_mentions": "AI and big data for well optimization and decline management, completions efficiency benchmarking (HP-hours/day), refrac program, positive offset well (POW) analysis, carbon capture (CCUS/Barnett Zero), Upper Barnett appraisal",
    "completions_strategy": "Disciplined multi-stage completions with efficiency records; active refrac program on Bedrock DUCs; focus on POW production uplift (~22% above type curve through 150 days); Upper Barnett appraisal wells planned for 2026",
    "service_provider_mentions": "None named",
    "metrics_reported": "Production: 940 MMcfe/d Q4; completions efficiency >22 HP-hours/day; D&C cost $545/ft; POW uplift ~22% above type curve through 150 days; 8% exit-to-exit growth; reserves ~6 Tcfe 1P",
    "seismos_relevance": "Medium",
    "seismos_relevance_detail": "BKV's emphasis on completions efficiency records, POW production analysis, and AI-driven optimization in a mature Barnett play creates a relevant entry point for Seismos real-time diagnostics. Refracs and DUC completions on Bedrock assets are near-term opportunities. However, BKV is a gas-focused mid-size operator in the Barnett - not a Permian/unconventional oil operator - and no direct frac diagnostics or CLF language was used. Relevance is process/efficiency driven rather than diagnostic.",
    "notable_quote": "We set multiple internal records above 22 horsepower-hours per day"
  },
  {
    "ticker": "BP",
    "company": "BP p.l.c.",
    "segment": "Major",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "BP executed a turnaround in 2025 with $2B in structural cost reductions, 7 major project startups, and record plant reliability above 96%, while suspending buybacks to accelerate balance sheet repair targeting $14-18B net debt by 2027. BPX Lower 48 achieved 20% improvement in completion time and 9% improvement in drilling time, representing significant capital productivity gains. AI and digital twins are deployed for real-time reservoir/wells/facilities monitoring across operations.",
    "capex_guidance": "$13-13.5B organic CapEx 2026 (low end of prior guidance range); 2026 production ~2.3 MMboe/d broadly flat",
    "basin_focus": "BPX Lower 48 (Permian, Eagle Ford, Haynesville), Gulf of America (Paleogene/Kaskida/Tiber), Brazil (Bumerangue discovery ~8B bbl in place), Azerbaijan, North Sea",
    "technology_mentions": "Dynamic digital twins, AI/automation for real-time reservoir/wells/facilities monitoring; 'Wells Adviser' AI system for wellsite decisions; AI kick detection (90% success rate); BPX 20% completion time improvement, 9% drilling time improvement; geo-steering for horizontal wells",
    "completions_strategy": "BPX 20% improvement in completion time enabling 8-rig equivalent of prior 10-rig program; geo-steering long undulating horizontals; 3/4 of wells in top or second quartile; first/second quartile focus in Permian, Eagle Ford, Haynesville",
    "service_provider_mentions": "Transocean (Mykonos deepwater rig for Brazil appraisal); no completions service vendors named",
    "metrics_reported": "FY2025 underlying RC profit $7.5B; OCF $24.5B; CapEx $14.5B; adjusted FCF ~$13B; ROACE 14% price-adjusted; reserves replacement 90%; plant reliability >96%; wells reliability ~98%; BPX average IRR 45% at $65 WTI",
    "seismos_relevance": "Medium",
    "seismos_relevance_detail": "BPX completion efficiency gains (20% improvement) and real-time monitoring via AI/digital twins are directly relevant to Seismos CLF value proposition. BPX operates in Permian, Eagle Ford, and Haynesville — all Seismos target basins. However, no specific completions diagnostics technology named. AI monitoring emphasis signals openness to real-time optimization tools like SAFA.",
    "notable_quote": "20% improvement in completion time, 9% improvement in drilling time"
  },
  {
    "ticker": "CHRD",
    "company": "Chord Energy Corporation",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "Chord is executing a low-to-no oil growth strategy focused on free cash flow maximization and capital efficiency in the Bakken. The company converted 80% of inventory to long laterals ahead of schedule, reducing weighted average breakeven by over 10%, and is trialing surfactant/chemical treatments to enhance well performance.",
    "capex_guidance": "$1.4B (2026)",
    "production_guidance": "157,000-161,000 Bopd oil (flat/maintenance mode)",
    "basin_focus": [
      "Williston Basin (Bakken)"
    ],
    "technology_mentions": [
      "surfactant and chemical treatments",
      "alternative well geometries",
      "long lateral conversion (3-mile and 4-mile)"
    ],
    "completions_strategy": "One full-time frac crew with spot crew releasing mid-summer. Five drilling rigs balanced between 3-mile and 4-mile laterals. Approximately 80% of TILs expected to be longer laterals. Actively trialing 19 surfactant and chemical treatments to enhance well performance and evaluating alternative well geometries.",
    "service_provider_mentions": [],
    "efficiency_metrics": "F&D costs declined 22% over several years. Weighted average breakeven fell >10% in 2025. Capital spending $60M below plan in 2025. Marketing/midstream savings of $30-50M annual run-rate. $160M total FCF improvement from controllable factors in 2025.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Actively trialing completions innovations including surfactant treatments and alternative well geometries. Early adopter mentality on technology when results merit. However, Bakken-focused with limited Permian exposure and only one full-time frac crew limits near-term CLF opportunity.",
    "notable_quote": "We have pumped 19 chemical and surfactant treatments already, and we are evaluating those results.",
    "data_quality": "Full transcript"
  },
  {
    "ticker": "CLB",
    "company": "Core Laboratories Inc.",
    "segment": "OFS-Diagnostics",
    "quarter": "Q4 2025",
    "strategy_summary": "Core Laboratories delivered 7% YoY revenue growth to $138.3M in Q4 2025, driven by strong demand for completion diagnostic services across US onshore and offshore markets despite missing EPS forecasts. The company is expanding its proprietary SpectraStim proppant tracer diagnostics for evaluating plugless completion designs and diverter-based stage isolation, while the Pulverizer plug-and-abandonment system won a global innovation award. Management maintained its three financial tenets: maximize free cash flow, maximize ROIC, and return excess cash to shareholders.",
    "capex_guidance": "$15-$18 million for 2026 (excluding UK facility rebuild, which is insurance-covered); 2-4% of revenue",
    "production_guidance": "Q1 2026 revenue guidance: $124-$130 million; operating income $9.7-$12.2 million (~9% margin); EPS $0.11-$0.15",
    "basin_focus": [
      "US onshore (multiple basins)",
      "Middle East",
      "Asia Pacific",
      "Offshore global"
    ],
    "technology_mentions": [
      "SpectraStim proppant tracer diagnostics",
      "Pulverizer plug-and-abandonment system",
      "Trimmer Frac Diagnostics",
      "limited-entry perforation evaluation",
      "diverter-based stage isolation assessment",
      "mobile lab capabilities"
    ],
    "completions_strategy": "Strong demand for proprietary completion diagnostic services across US onshore and offshore markets. SpectraStim deployed to evaluate plugless completion designs using diverter-based stage isolation, confirming stimulation effectiveness across multi-stage laterals. Trimmer Frac Diagnostics supporting complex US land completion designs with limited-entry perforations and extended lateral lengths. Production Enhancement segment revenue $46M (up 8% YoY) despite sequential margin compression from Asia Pacific receivable provision.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Service revenue $107M (up 6% sequentially, up 11% YoY); Production Enhancement margins 7% Q4 vs 11% Q3; net debt reduced to $90.2M (leverage ratio 1.09); net debt reduced $205.8M (70%) since Q4 2019; tariff headwind $0.02-$0.03/share per quarter",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Core Laboratories is adjacent to Seismos in the frac diagnostics space - their SpectraStim proppant tracers and Trimmer Frac Diagnostics directly evaluate completion effectiveness, the same outcome CLF/acoustic sensing targets. They are a potential competitor in diagnostics-as-a-service for operators evaluating completions. However, Core's approach is post-job chemical/tracer-based while Seismos provides real-time acoustic monitoring during pumping - making them potentially complementary rather than purely competitive. Worth monitoring as a partnership or competitive reference.",
    "notable_quote": "Core deployed its proprietary SpectraStim proppant tracer diagnostics to assess diverter-based stage isolation and to verify stimulation effectiveness across the multiple stage laterals.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "COP",
    "company": "ConocoPhillips",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "ConocoPhillips is focused on capital discipline post-Marathon acquisition, targeting 15%+ D&C efficiency improvements. Permian and Eagle Ford remain core development areas with growing Lower 48 production.",
    "capex_guidance": "$12.2-12.8B",
    "production_guidance": "1.99-2.07 MMBOE/d",
    "basin_focus": [
      "Permian",
      "Eagle Ford",
      "Bakken",
      "Alaska"
    ],
    "technology_mentions": [
      "simul-frac",
      "longer laterals",
      "D&C optimization"
    ],
    "completions_strategy": "Driving 15%+ D&C efficiency improvement through simul-frac deployment, longer laterals, and optimized completion designs. Marathon integration expanding completions scale.",
    "service_provider_mentions": [
      "Halliburton"
    ],
    "efficiency_metrics": "15%+ D&C efficiency improvement target, expanding 3-mile laterals",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Major completions spender with active efficiency improvement program. 15%+ D&C efficiency target and simul-frac adoption make them a strong CLF target account.",
    "notable_quote": "We see significant runway for continued D&C efficiency improvements across our portfolio",
    "data_quality": "Search summary"
  },
  {
    "ticker": "CPG",
    "company": "Crescent Point Energy Corp. (now Veren Inc., acquired by Whitecap Resources May 2025)",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "Crescent Point Energy rebranded to Veren Inc. (TSX/NYSE: VRN) in May 2024 and was acquired by Whitecap Resources (TSX: WCP) in May 2025, ceasing to exist as an independent public company. The ticker CPG no longer trades as of May 2025. Veren's final standalone Q4 2024 results (reported February 27, 2025) showed 188,721 boe/d production (+16% YoY), with 77% of production from Alberta Montney and Kaybob Duvernay. Whitecap absorbed Veren's assets and reports Q4 2025 results under WCP ticker with 307,245 boe/d record 2025 production.",
    "capex_guidance": "Veren's 2025 standalone capex was not tracked (acquired in May 2025). Whitecap (post-Veren merger) 2026 capital budget: CAD $2.0-2.1 billion, split 75% unconventional / 25% conventional. Whitecap is building Lator 04-13 facility for 11 net Montney wells in 2026, targeted completion Q4 2026.",
    "production_guidance": "Veren (standalone) 2025 guidance was 188,000-196,000 boe/d at time of Q4 2024 results. Whitecap post-merger 2026 guidance: 370,000-375,000 boe/d (Q4 2026 exit rate 380,000 boe/d), representing 22% growth vs. 2025 average. Montney and Duvernay assets ~75-80% of unconventional capital.",
    "basin_focus": [
      "Alberta Montney (Canada)",
      "Kaybob Duvernay (Alberta, Canada)",
      "Saskatchewan (Canada)"
    ],
    "technology_mentions": [
      "Single Point Entry (SPE) completion designs in Carr (Alberta Montney) - 30% above type well IP30",
      "SPE design testing in Karr (Montney)",
      "Multi-well pad development",
      "Gas egress infrastructure expansion (Gold Creek West)"
    ],
    "completions_strategy": "Veren/Crescent Point was actively testing Single Point Entry (SPE) completion designs in the Alberta Montney at Carr, achieving 30% above type well IP30 rates (average peak 30-day rate of 1,270 boe/d per well at 80% oil cut). SPE design expanded to Karr and Gold Creek in 2025. Kaybob Duvernay completions delivered 25% above type well IP30 rates. Completions innovation was a key operational differentiator. No CLF or real-time frac monitoring mentioned.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Veren Q4 2024: 188,721 boe/d production; adjusted funds flow $619.6M ($1.01/share); net debt reduced 35% to $2.48B; Montney/Duvernay 77% of production. SPE completion design: 1,270 boe/d per well peak 30-day rate (30% above type well). Whitecap post-merger: $300M realized synergies vs. $210M target.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Veren/Crescent Point was an active completions innovator in the Alberta Montney and Kaybob Duvernay, testing SPE completion designs and tracking per-well performance improvements. The focus on completion design optimization represents a potential entry point for Seismos technology. However, the company no longer exists as an independent entity (absorbed into Whitecap in May 2025). Future engagement would be through Whitecap Resources (WCP).",
    "notable_quote": "Veren Q4 2024 call: CEO Craig Bryksa stated 'We continue to be excited about the quality of our asset base.' SPE completion design at Carr generated 'average peak 30-day rate of 1,270 boe/d per well, 30% above the area type well' at 80% oil cut.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "CRGY",
    "company": "Crescent Energy Company",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "Crescent completed a sweeping portfolio transformation in 2025, executing ~$5 billion in transactions to become a focused three-basin operator in the Eagle Ford, Permian, and Uinta. The 2026 focus shifts to integration and synergy delivery, targeting $190 million annual run-rate synergies (doubled from original targets) while running a 6-7 rig program and expanding simulfrac adoption to drive D&C cost efficiency.",
    "capex_guidance": "$1.3 billion+ development capital program for 2026",
    "production_guidance": "320-335 MBoe/d for 2026 (~25% YoY increase); relatively flat oil volumes in Eagle Ford and Permian throughout 2026",
    "basin_focus": [
      "Eagle Ford",
      "Permian Basin",
      "Uinta"
    ],
    "technology_mentions": [
      "simulfrac",
      "ESP (Electric Submersible Pump) optimization",
      "extended lateral lengths"
    ],
    "completions_strategy": "Expanding simulfrac to 70% of South Texas pads; increasing Eagle Ford lateral lengths by ~2,000 feet through strategic land trades; D&C costs per foot declined 15% YoY. Running 4 Eagle Ford rigs, 1 Uinta rig, 1-2 Permian rigs.",
    "service_provider_mentions": [],
    "efficiency_metrics": "D&C cost per foot down 15% YoY; $190M annual synergy run-rate (doubled); targeting ~7% reduction in adjusted operating expenses vs. full-year 2025; base decline rate targeting 25% or below within 12-18 months",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Active completions program with simulfrac adoption and extended laterals across Eagle Ford (core Seismos basin) and Uinta creates real-time frac optimization opportunity. 70% simulfrac penetration in South Texas and cost-efficiency focus make CLF/acoustic diagnostics a compelling add-on, though no technology vendors were named on the call.",
    "notable_quote": "We are now a focused and scaled operator in three premier basins: the Eagle Ford, the Permian, and the Uinta.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "CRK",
    "company": "Comstock Resources, Inc.",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "Comstock is aggressively developing the Western Haynesville play while doubling wells turned to sales from 12 to 24 in 2026. The company is pursuing a transformative behind-the-meter data center power strategy with NextEra (2-8 GW potential) and investing in rig upgrades to 10,000 PSI and 20,000 PSI frac fleet capabilities.",
    "capex_guidance": "$1.4-$1.5 billion D&E capex plus $100-$150 million midstream (2026)",
    "production_guidance": "1,250-1,400 MMcfe/d for full-year 2026 (Q1: 1,075-1,150 MMcfe/d)",
    "basin_focus": [
      "Haynesville",
      "Western Haynesville"
    ],
    "technology_mentions": [
      "rotary steerable drilling systems",
      "insulated drill pipe",
      "10,000 PSI rated rig upgrades",
      "20,000 PSI frac fleet upgrade"
    ],
    "completions_strategy": "Ramping from 8 to 9 operated rigs with 4 devoted to Western Haynesville. Plans to drill 47 wells and turn 48 to sales in 2026. Western Haynesville wells averaging 33 MMcf/d IP. Upgrading to 10,000 PSI rig by late summer and planning 20,000 PSI frac fleet upgrade. 11% YoY reduction in D&C costs for legacy assets. Two Western Haynesville wells per month and four legacy wells per month completion pace.",
    "service_provider_mentions": [
      "NextEra (data center power partnership)"
    ],
    "efficiency_metrics": "11% YoY reduction in D&C costs for legacy Haynesville. Finding cost of $1.02/Mcfe. 229% reserve replacement ratio. Western Haynesville wells at 33 MMcf/d average IP vs. 25 MMcf/d legacy.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Comstock is a major Haynesville completions spender ($1.4-1.5B capex) with active technology adoption including 20,000 PSI frac fleet upgrades and rotary steerable systems. The high-pressure Western Haynesville development and aggressive completions pace (48 wells to sales in 2026) present potential for frac diagnostics and optimization. No specific CLF or acoustic sensing mentions.",
    "notable_quote": "Comstock plans to increase the number of operating drilling rigs from eight to nine during 2026, with four devoted to the Western Haynesville.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "CTRA",
    "company": "Coterra Energy Inc.",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "Coterra is merging with Devon Energy in a $58B all-stock deal expected to close Q2 2026, creating a super-independent with dominant Delaware Basin position and diversified Marcellus/Eagle Ford/Williston portfolio. Standalone 2026 guidance targets 5%+ annual oil growth with sub-50% reinvestment rate, while the Marcellus program delivers best-in-class returns.",
    "capex_guidance": "$2.1B-$2.4B annual average (three-year outlook 2025-2027); Q4 2025 capex was $594M",
    "production_guidance": "750-810 MBoepd total, 162-172 MBopd oil, 2,775-2,975 MMcfpd gas (2026 standalone)",
    "basin_focus": [
      "Delaware Basin (Permian)",
      "Marcellus Shale"
    ],
    "technology_mentions": [
      "new landing zone development",
      "midstream optimization"
    ],
    "completions_strategy": "Ran nine rigs in Permian in H2 2025; maintained second rig in Marcellus through 2025 due to record-setting well performance. Completed integration of Delaware Basin acquisitions with focus on landing zone optimization and lower operating costs. No specific completions technology innovations discussed.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Marcellus wells: 11 wells turned online Dec 2024 with peak 30-day rate of 450 MMcf/d. 2025 reinvestment rate of 54%. Generated $2.0B free cash flow (up 67% YoY). Integration yielded lower operating costs and optimized midstream commitments.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Major Permian operator with active Delaware Basin completions program and focus on completions optimization through landing zone development. Pending Devon merger will create massive combined completions operation. No specific frac technology mentions but scale of operations presents opportunity.",
    "notable_quote": "Our Marcellus program is our best return right now.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "DVN",
    "company": "Devon Energy",
    "segment": "E&P Operator",
    "quarter": "Q4 2025",
    "transcript_url": "InsiderMonkey full transcript",
    "strategy_summary": "Devon announced a merger with Coterra Energy, creating a $3.5B upstream capex combined entity. Pre-merger Devon is executing a business optimization program targeting $1B in savings (85% achieved). Technology focus is on AI-enabled artificial lift optimization, condition-based maintenance, and Fervo geothermal investment. Delaware Basin focus with 90% NM activity.",
    "capex_guidance": "$3.5B upstream capex (combined Devon+Coterra basis)",
    "basin_focus": [
      "Delaware Basin (90% New Mexico)",
      "Anadarko",
      "Eagle Ford",
      "Williston"
    ],
    "technology_mentions": [
      "AI-enabled artificial lift optimization",
      "Condition-based maintenance (predictive)",
      "Fervo geothermal investment",
      "100+ active work streams for operational improvement",
      "Real-time production monitoring"
    ],
    "completions_strategy": "Devon's primary technology narrative is production optimization (artificial lift, condition-based maintenance) rather than completions diagnostics. Delaware Basin mix is 40% Wolfcamp, 45% Bone Spring, 15% Avalon. Merger with Coterra creates scale efficiency rationale. No CLF or acoustic frac diagnostics mentioned.",
    "service_provider_mentions": [
      "Coterra Energy (merger partner)",
      "Fervo Energy (geothermal investment)"
    ],
    "metrics_reported": {
      "combined_upstream_capex": "$3.5B",
      "business_optimization_target": "$1B",
      "business_optimization_achieved": "85%",
      "delaware_nm_activity": "90%",
      "wolfcamp_mix": "40%",
      "bone_spring_mix": "45%",
      "avalon_mix": "15%"
    },
    "seismos_relevance": "Medium",
    "seismos_relevance_detail": "Devon's AI-enabled optimization focus shows operator appetite for data-driven performance tools, though the emphasis is production rather than completions. Post-Coterra merger, the combined entity will be a large Permian operator with significant completion activity — a future enterprise target for Seismos. The merger itself may delay technology vendor decisions as organizations integrate. Condition-based maintenance philosophy is compatible with Seismos's real-time diagnostics pitch.",
    "notable_quote": "We've deployed AI-enabled artificial lift optimization and condition-based maintenance across our portfolio, contributing to the $850 million in business optimization savings achieved to date."
  },
  {
    "ticker": "EC",
    "company": "Ecopetrol S.A.",
    "segment": "International",
    "quarter": "Q4 2025",
    "strategy_summary": "Ecopetrol's Q4 2025 and full-year results are scheduled for release on March 4, 2026 (not yet available as of February 27, 2026). Based on Q3 2025 data, the company achieved average production of 751,000 boe/d for the first nine months of 2025, at the upper end of guidance, with EBITDA of COP 12.3 trillion (+11% QoQ) and proven reserves replacement ratio of 121%. The company faces a more challenging 2026 price environment and is focused on capital discipline.",
    "capex_guidance": "2025 capex guidance: $5.8-6.8 billion (full year), with $4.2 billion invested through Q3 2025 (72% of annual target). 2026 capex guidance not yet released; expected with Q4 2025 results on March 4, 2026.",
    "production_guidance": "2025 full-year guidance: 740,000-750,000 boe/d (at upper end as of Q3 2025). 2026 production plan under development as of Q3 2025; formal guidance expected March 4-5, 2026. Permian Basin contributed ~106,000 boe/d net before royalties (14% of total production).",
    "basin_focus": [
      "Llanos Basin (Colombia)",
      "Permian Basin - Midland (USA)",
      "Putumayo (Colombia)",
      "Caño Sur (Colombia)",
      "CPO-09 (Colombia)"
    ],
    "technology_mentions": [
      "New well designs with lower fracture pressures and reduced pumping times in Permian Basin",
      "Tertiary recovery via air injection at Chichimene field",
      "Enhanced recovery representing 41% of total output",
      "Green hydrogen plant (Colombia's largest) started operations"
    ],
    "completions_strategy": "In the Permian Basin, Ecopetrol explicitly credited new well designs, lower fracture pressures, and reduced pumping times as drivers of cost reductions per foot drilled and per barrel pumped vs. plan. This represents active completions optimization. Colombian operations focus on conventional enhanced recovery. No CLF or real-time frac monitoring mentioned.",
    "service_provider_mentions": [
      "Parex Resources (alliance in Putumayo, $350M commitment)"
    ],
    "efficiency_metrics": "Permian: lower cost per foot drilled and per barrel pumped vs. plan via frac design optimization. EBITDA margin 41% in Q3 2025. Refining throughput 413,000 bbl/d in Q3 2025 (post-maintenance recovery). Transportation throughput 1,098,000 bbl/d.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Ecopetrol operates in the Permian Basin (Midland) and explicitly discussed completions optimization including lower fracture pressures and new well designs as efficiency levers. As a significant Permian operator with active completion design work, there is a plausible entry point for Seismos CLF technology. However, no real-time frac monitoring or diagnostic technology was mentioned by name.",
    "notable_quote": "Q3 2025 call (November 14, 2025): 'Reductions in operating times and costs in the Permian were achieved thanks to new well designs, lower fracture pressures, and pumping times, which resulted in lower costs per foot drilled and per barrel pumped compared to the plan.'",
    "data_quality": "Search summary"
  },
  {
    "ticker": "EOG",
    "company": "EOG Resources",
    "segment": "E&P Operator",
    "quarter": "Q4 2025",
    "transcript_url": "InsiderMonkey full transcript",
    "strategy_summary": "EOG is running a $6.5B 2026 capex program across Delaware, Utica, Eagle Ford, and Dorado with 24 rigs and 10 completion crews. Well costs declined 7% in 2025 with low single-digit further reductions targeted in 2026. Super Zipper high-intensity completions are a core operational focus, with ML-based production optimizers deployed across the portfolio.",
    "capex_guidance": "$6.5B total 2026; $725/ft Delaware, <$600/ft Utica, $750/ft Dorado",
    "basin_focus": [
      "Delaware Basin (Permian)",
      "Utica Shale (Ohio)",
      "Eagle Ford",
      "Dorado (South Texas gas)"
    ],
    "technology_mentions": [
      "Super Zipper high-intensity completion operations",
      "EOG motor program (drilling efficiency)",
      "ML-based production optimizers",
      "High-intensity completions (increased fluid/proppant intensity)",
      "Extended laterals (2-4 miles)"
    ],
    "completions_strategy": "Super Zipper zipper fracs with high fluid and proppant intensity. 10 completion crews across 4 plays. Completed lateral feet per day improving. 585 net wells planned in 2026. No specific CLF or acoustic diagnostics mentioned — EOG operates a large in-house technical team with proprietary completion designs.",
    "service_provider_mentions": [
      "ProFrac (inferred as major Delaware pumper)",
      "unnamed completion service providers"
    ],
    "metrics_reported": {
      "FY2026_capex": "$6.5B",
      "active_rigs": "24",
      "completion_crews": "10",
      "net_wells_2026": "585",
      "well_cost_reduction_2025": "7%",
      "delaware_well_cost": "$725/ft",
      "utica_well_cost": "<$600/ft",
      "dorado_well_cost": "$750/ft"
    },
    "seismos_relevance": "Medium",
    "seismos_relevance_detail": "EOG's Super Zipper operations and high-intensity completions are the type of complex multi-well programs where perf efficiency (SAFA's primary metric) matters most. With 10 completion crews and 585 wells planned, even modest efficiency gains from CLF would be meaningful at scale. EOG's ML production optimizers show operator appetite for algorithmic decision-making. No direct CLF or acoustic mentions — EOG builds significant internal IP. A potential target customer but likely a hard enterprise sale.",
    "notable_quote": "We continue to improve total completed lateral feet per day while driving down well costs — targeting low single-digit improvements again in 2026 across all our major plays."
  },
  {
    "ticker": "EXE",
    "company": "Expand Energy Corporation",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "Expand Energy (formerly Chesapeake + SWN) delivered 15% reduction in Haynesville breakevens in 2025 through evolved completion designs progressing from 'gen one' to 'gen three' and self-sourcing sand, while expecting sustainable first-year production gains in 2026. The company is shifting commercial focus to premium markets targeting $0.20/Mcf uplift (~$500M EBITDA) over 3-5 years and expanding 5 Bcf storage capacity. CEO sees natural gas demand growing 35-40% over five years and is focused on aggressive commercial execution.",
    "capex_guidance": "Maintenance capital ~$225M lower YoY for same ~7.5 Bcf/d production; flexible activity based on $3.50-$4.00 mid-cycle gas price view",
    "basin_focus": "Haynesville (primary, lowest breakeven improvements), Appalachian (Southwest Pennsylvania inventory), Gulf Coast marketing via NG3/Gillis",
    "technology_mentions": "Completion design evolution ('gen one' to 'gen three'); self-sourcing sand for completion outcomes; drilling efficiency improvements; 5 Bcf storage deployment",
    "completions_strategy": "Progressive completion design iterations in Haynesville driving breakeven reduction; self-sourced sand to improve completion quality; maintaining flexibility on completion timing based on gas price; five Utica laterals planned for CNX-style completion (note: this is EXE not CNX)",
    "service_provider_mentions": "No specific service providers named; sand self-sourcing mentioned",
    "metrics_reported": "15% Haynesville breakeven reduction; $200M hedging gains 2025; 5 Bcf storage capacity; ~7.5 Bcf/d maintenance production level",
    "seismos_relevance": "Medium",
    "seismos_relevance_detail": "Expand Energy is the largest natural gas producer in the U.S. with extensive Haynesville operations. Completion design optimization is central to their strategy ('gen one to gen three'). While no specific diagnostics technology is mentioned, the emphasis on completion efficiency gains and evolving designs signals openness to tools that quantify frac performance. Haynesville is a Seismos target basin. Medium relevance as a prospective target account.",
    "notable_quote": "Completion designs progressed from gen one at merger close to gen three with improved results"
  },
  {
    "ticker": "FANG",
    "company": "Diamondback Energy",
    "segment": "E&P Operator",
    "quarter": "Q4 2025",
    "transcript_url": "InsiderMonkey full transcript",
    "strategy_summary": "Diamondback is running a $3.75B 2026 program tightly focused on Permian core Midland and emerging Barnett development. Continuous pumping at 4,500+ ft/day is a primary operational focus. Active surfactant trial program (60 wells at ~$500K/well) and stage design optimization underway. Barnett at $1,000/ft targeting $800/ft via learning curve. 15,000-ft laterals in Barnett.",
    "capex_guidance": "$3.75B total 2026; $510-520/ft Midland core, Barnett targeting $800/ft (from $1,000/ft)",
    "basin_focus": [
      "Permian Basin (Midland)",
      "Barnett Shale (emerging)"
    ],
    "technology_mentions": [
      "Simul-frac (simultaneous fracturing)",
      "Continuous pumping (4,500+ ft/day average, up to 5,500 ft/day recorded)",
      "Surfactant testing (60-well trial, ~$500K/well cost)",
      "Stage design optimization",
      "Extended laterals (15,000 ft in Barnett)"
    ],
    "completions_strategy": "Continuous pumping is the primary efficiency driver — Diamondback treats downtime as the enemy. Simul-frac on longer laterals. Active surfactant trial to quantify oil uplift (60-well program). Stage design optimization to reduce cost per foot in Barnett from $1,000 to $800. No real-time diagnostics or acoustic monitoring mentioned.",
    "service_provider_mentions": [
      "ProFrac (inferred, major Permian pumper)",
      "unnamed completion service companies"
    ],
    "metrics_reported": {
      "FY2026_capex": "$3.75B",
      "midland_core_well_cost": "$510-520/ft",
      "barnett_current_cost": "$1,000/ft",
      "barnett_target_cost": "$800/ft",
      "continuous_pumping_avg": "4,500+ ft/day",
      "continuous_pumping_record": "5,500 ft/day",
      "surfactant_trial_wells": "60",
      "barnett_lateral_length": "15,000 ft"
    },
    "seismos_relevance": "Medium",
    "seismos_relevance_detail": "Diamondback's intense focus on continuous pumping (treating any stoppage as lost value) maps directly to Seismos's SAFA pitch — perf friction detection reduces NPT during plug-and-perf operations. With 4,500+ ft/day operations, even a 5% reduction in NPT from better perf efficiency is commercially significant. The 60-well surfactant trial also shows Diamondback is actively A/B testing completion technologies, suggesting openness to diagnostic tools that can quantify uplift. Barnett development at $1,000/ft gives a higher-cost target where optimization ROI is clear.",
    "notable_quote": "We achieved a 5,500-foot-per-day continuous pumping record in the Midland Basin — never underestimate the American engineer."
  },
  {
    "ticker": "GPOR",
    "company": "Gulfport Energy Corporation",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "Gulfport is focused on capital-efficient Utica and Marcellus dry/wet gas development with longer laterals averaging 16,900 feet in 2026, up from 13,500 feet. The company is completing a discretionary acreage acquisition program adding 2+ years of core inventory while returning over 100% of adjusted FCF to shareholders via buybacks.",
    "capex_guidance": "$400M-$430M total ($365M-$390M D&C, $35M-$40M land/seismic)",
    "production_guidance": "Q4 2026 production ~5% above Q4 2025 levels",
    "basin_focus": [
      "Appalachia",
      "Utica",
      "Marcellus",
      "SCOOP"
    ],
    "technology_mentions": [
      "proprietary 3D seismic",
      "U-development wells",
      "sidewall cores",
      "extended lateral lengths"
    ],
    "completions_strategy": "Completion efficiency increased 26% from 2022-2025 but dipped in 2025 due to regional drought and spot crew utilization; frac efficiency averaged 18 hours/day. First U-development wells in Utica completed in Q4, brought online Q1 2026. Marcellus North wells planned with full science program (sidewall cores, logging, tests) to properly design fracs, completions deferred to 2027. Targeting 15,000-18,000 ft optimal lateral lengths. Utica D&C costs down to $920/lateral foot in 2026.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Drilling footage/day improved 80% from 2022-2025. Completion efficiency up 26% over same period but dipped in 2025. Top-hole drilling shaved couple days/well. Utica D&C costs ~$920/lateral foot. Full-year 2025 D&C capital $428.4M. Q4 operating cash flow $222M, exceeding capex by 2x.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Active completions operator focused on frac design optimization with science-driven approach (sidewall cores, logging for frac design). Completion efficiency dipped in 2025 and is a stated focus area. Collecting data to 'properly design fracs' in Marcellus North. However, no specific mentions of CLF, acoustic sensing, or real-time frac monitoring technologies.",
    "notable_quote": "Drilling footage per day improved by approximately 80% between 2022 and 2025, while completion efficiency increased 26% over the same period.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "KLXE",
    "company": "KLX Energy Services Holdings, Inc.",
    "segment": "OFS-Completions",
    "quarter": "Q3 2025",
    "strategy_summary": "KLX reported Q3 revenue of $166.7M with adjusted EBITDA of $21.1M and 12.7% margins, outperforming despite a 6% rig count decline. The company continues to emphasize its diversified completions services portfolio including wireline, coiled tubing, and the VISION Suite of downhole tools, while targeting gas-basin growth tied to LNG demand. Q4 2025 results have not yet been released.",
    "capex_guidance": "Q3 net capex $7.8M; no 2026 guidance yet (Q4 2025 not reported)",
    "production_guidance": "N/A",
    "basin_focus": [
      "Permian",
      "Gulf Coast",
      "Midcontinent",
      "Northeast/Appalachia",
      "Rockies"
    ],
    "technology_mentions": [
      "VISION Suite",
      "OraclE-Smart Reach Tool (SRT)",
      "SpectrA PDC",
      "PhantM Dissolvables",
      "large-diameter coiled tubing",
      "wireline pump down perforating"
    ],
    "completions_strategy": "Core completions services provider with 50+ products/services. VISION Suite of downhole completions tools is their technology differentiator, including dissolvable tools and smart reach tools. Operates one of the largest US wireline fleets (130+ units) and 24 large-diameter coiled tubing spreads. Northeast/Mid-Con segment surging on gas activity.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Adjusted EBITDA margin 12.7% (up from 11.6% QoQ); total liquidity $65.2M; overhead cost discipline driving margin expansion despite lower rig count",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Direct completions services provider (wireline, coiled tubing, frac rentals, downhole tools). While no specific frac diagnostics or real-time monitoring mentions, their VISION Suite and completions tool innovation suggest openness to advanced completions technology. Potential channel partner or customer for Seismos CLF data integration with wireline/perf operations.",
    "notable_quote": "The outperformance was complemented by disciplined management of fixed costs, resulting in consolidated adjusted EBITDA margin expansion to 12.7% from 11.6% in Q2.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "MTDR",
    "company": "Matador Resources Company",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "Matador is prioritizing free cash flow over production growth, targeting 3% oil growth while cutting capex 11% to $1.50B. The company is leveraging Delaware Basin efficiency gains including a 13% reduction in drill-and-complete cycle times and expanding its surfactant-enhanced completions program.",
    "capex_guidance": "$1.50 billion (down 11% YoY from $1.53B)",
    "production_guidance": "122,000-124,000 Bo/d and 525-545 MMcf/d (209,500-215,000 BOE/d)",
    "basin_focus": [
      "Delaware Basin",
      "Permian Basin"
    ],
    "technology_mentions": [
      "enhanced completion surfactants",
      "produced water recycling (72% of frac water)",
      "artificial intelligence integration",
      "Wolfcamp",
      "Bone Spring",
      "Third Bone Spring Carbonate",
      "Avalon",
      "Woodford exploratory"
    ],
    "completions_strategy": "Large-batch and longer-lateral completions front-loaded in H1 2026 (55-60% of full-year capex). D&C cost expected at ~$795/lateral foot, down 6% YoY. 20% YoY completion efficiency improvement. Expanded surfactant program showing improved 150-day cumulative production vs. control wells. 72% of frac water sourced from produced water.",
    "service_provider_mentions": [],
    "efficiency_metrics": "D&C cost ~$795/lateral foot (6% reduction YoY). 13% reduction in drill-and-complete cycle time. 20% completion efficiency improvement YoY. 10% EUR improvement per well.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Active completions technology adoption including surfactant-enhanced completions program, significant focus on frac efficiency and cost optimization, and AI integration plans. No specific mention of CLF, acoustic sensing, or frac diagnostics, but the completion efficiency and technology openness signals potential receptivity.",
    "notable_quote": "Matador anticipates its 2026 drilling and completion cost to be approximately $795 per lateral foot, a 6% reduction compared to 2025.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "NINE",
    "company": "Nine Energy Service, Inc.",
    "segment": "OFS-Completions",
    "quarter": "Q4 2025",
    "strategy_summary": "Nine Energy is struggling with Permian Basin pricing pressure and market share losses in completion tools due to customer consolidation and casing size changes. The company is pivoting toward international markets (UAE, Argentina, Australia) and gas-levered basins (Northeast, Haynesville) while investing in new completion tool technology and a 30,000 sq ft manufacturing facility to regain competitiveness.",
    "capex_guidance": "FY2025 at lower end of $15M-$25M range (2026 not yet provided; Q4 2025 not yet reported)",
    "production_guidance": "N/A",
    "basin_focus": [
      "Permian Basin",
      "Haynesville",
      "Northeast (Marcellus/Utica)",
      "UAE",
      "Argentina",
      "Australia"
    ],
    "technology_mentions": [
      "latex-based cement slurry (high-temp)",
      "completion tools (dissolvable plugs)",
      "wireline services",
      "coiled tubing",
      "cementing"
    ],
    "completions_strategy": "Core completions services provider across cementing, wireline, completion tools, and coiled tubing. Facing headwinds from completion design changes (casing size shifts) and Permian pricing saturation. Completed landmark 400F+ cementing job in Haynesville. R&D team actively developing new completion tool technology to address market share losses. International completions revenue up 19% YTD.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Q3 2025 revenue $132M (below $135M-$145M guidance). Adjusted EBITDA $9.6M. Net loss of $14.6M. Cementing jobs down 4%, wireline stages down 4%, completion tool stages down 27%. Liquidity $40.3M.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Nine is a pure-play completions services company (cementing, wireline, completion tools, coiled tubing) operating in basins where Seismos is active. Their struggles with completion design changes and need for differentiation could make them receptive to frac diagnostic partnerships, though they don't currently mention any real-time monitoring technologies.",
    "notable_quote": "Pricing pressure was most evident in the Permian Basin where the majority of rigs have come out of the market, and the competitive landscape is saturated.",
    "data_quality": "Limited data (Q4 2025 not yet reported as of Feb 27, 2026; data based on Q3 2025 results and Q4 guidance)"
  },
  {
    "ticker": "NOV",
    "company": "NOV Inc",
    "segment": "Oilfield Services — Equipment & Technology",
    "quarter": "Q4 2025",
    "transcript_url": "InsiderMonkey full transcript",
    "strategy_summary": "NOV delivered $8.74B revenue and $1.03B EBITDA for 2025. Wired pipe Downhole Broadband Services (DBS) doubled year-over-year in the North Sea, enabling high-frequency downhole data for faster decision-making. ATOM RTX robotics platform and digital solutions for drilling efficiency are growth areas. NA completions business softer on macro. Max Completions (Seismos partnership platform) not named explicitly in call.",
    "capex_guidance": "Not specified in summary; ongoing operational investment in wired pipe and digital",
    "basin_focus": [
      "North Sea (wired pipe/DBS primary growth)",
      "North America (completions, softer)",
      "Middle East",
      "International broadly"
    ],
    "technology_mentions": [
      "Wired pipe Downhole Broadband Services (DBS) — doubled YoY in North Sea",
      "High-frequency downhole data acquisition during drilling/completions",
      "ATOM RTX robotics platform (rig floor automation)",
      "Max Completions platform (Seismos partner — not named in call)",
      "Digital solutions for drilling efficiency",
      "Intervention and stimulation capital equipment segment"
    ],
    "completions_strategy": "NOV's completions exposure is through capital equipment (stimulation equipment, intervention tools) and the Max Completions platform. DBS wired pipe provides high-frequency downhole data that enables faster rig-floor decisions — adjacent to Seismos's acoustic sensing approach but focused on drilling rather than fracturing. NA completions equipment market softer.",
    "service_provider_mentions": [
      "Unnamed operators (North Sea)",
      "Seismos (implied via Max Completions partnership — not named in call)"
    ],
    "metrics_reported": {
      "FY2025_revenue": "$8.74B",
      "FY2025_EBITDA": "$1.03B",
      "DBS_growth": "doubled YoY in North Sea"
    },
    "seismos_relevance": "Medium",
    "seismos_relevance_detail": "NOV is a Seismos partner via Max Completions. The call did not mention Max Completions or Seismos by name, suggesting the partnership is not yet commercially material enough to feature in investor communications. DBS wired pipe technology is philosophically adjacent to Seismos's acoustic surface sensing — both capture high-frequency downhole signals to improve decision-making — but operate at different well phases (drilling vs. fracturing) and data capture points (downhole vs. surface acoustic). NOV's offshore/drilling orientation limits direct CLF overlap, but the partnership validates NOV's intent to expand completions intelligence offerings.",
    "notable_quote": "Downhole Broadband Services — our wired pipe technology — more than doubled year-over-year in the North Sea, enabling operators to capture high-frequency downhole data for faster decision-making during drilling operations."
  },
  {
    "ticker": "PTEN",
    "company": "ProPetro Holding Corp (FILE MISMATCH - expected Patterson-UTI)",
    "segment": "OFS - Pumper (Permian-focused pressure pumping)",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "FILE NOTE: PTEN.txt contains ProPetro (PUMP) Q4 2025 data, not Patterson-UTI (PTEN). ProPetro reported Q4 revenue of $290M (beat), adjusted EPS of $0.01 (beat vs -$0.13 est), with EBITDA up 46% QoQ to $51M. The company's major strategic pivot is PROPWR - a power generation business targeting 1 GW+ of installed capacity by 2030, with 550 MW ordered. ProPetro plans 11 active frac fleets in Q1 2026 and is investing $140-160M in completions business in 2026 including fleet automation and direct drive gas frac units.",
    "capex_guidance": "$390-435M total 2026 capex: $140-160M completions (incl. $40-50M FORCEelectric lease buyouts, fleet automation, gas frac units); $250-275M PROPWR power generation",
    "basin_focus": "Permian Basin (Midland, TX-based, primary focus)",
    "technology_mentions": "PROPWR (power generation business, 550 MW ordered, 1 GW+ by 2030); FORCEelectric frac fleet (electric frac, lease buyout program); fleet automation technology investment; direct drive gas frac units; wireline technology",
    "completions_strategy": "Operating 11 active frac fleets in Q1 2026 (near-term constraint on adding fleets); investing in fleet automation and transitioning from Tier IV DGB to gas frac/electric units; PROPWR power pivot is the dominant 2026 investment theme with completions business as secondary focus",
    "service_provider_mentions": "Caterpillar Financial Services (financing expansion to ~$157M); Stonebriar Commercial Finance ($350M lease facility for PROPWR)",
    "metrics_reported": "Q4 revenue: $290M; hydraulic fracturing segment revenue: $203.9M (73.2% of total); wireline revenue: $55.4M; adjusted EBITDA: $51M (46% QoQ increase); FCF (completions): ~$98.1M; PROPWR committed capacity: ~240 MW; total PROPWR ordered: 550 MW; target by end 2027: 750 MW+; by 2030: 1 GW+",
    "seismos_relevance": "Medium",
    "seismos_relevance_detail": "ProPetro is a Permian-focused pressure pumper directly in Seismos's target market (ProFrac and Liberty are Seismos partners; ProPetro is the third major independent Permian pumper). The fleet automation investment and transition to electric/gas frac fleets creates a natural CLF integration opportunity. However, ProPetro's 2026 investment narrative is dominated by PROPWR power generation, suggesting completions technology spending may be constrained. The FORCEelectric fleet and direct drive gas frac units are the relevant fleet segments for Seismos CLF integration.",
    "notable_quote": "PROPWR total committed capacity expanded to approximately 240 megawatts with growth anticipated in 2026"
  },
  {
    "ticker": "RRC",
    "company": "Range Resources Corporation",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "Range Resources is executing a capital-efficient Appalachian growth plan targeting 6% production growth on flat capex, leveraging a large DUC inventory of 500,000+ lateral feet. The company runs an electric frac fleet under a two-year agreement and is achieving nearly 10 frac stages per day per crew.",
    "capex_guidance": "$650-$700 million for 2026",
    "production_guidance": "2.35-2.40 Bcfe/d for 2026, ramping to ~2.6 Bcfe/d in 2027",
    "basin_focus": [
      "Appalachia (Marcellus/Utica)"
    ],
    "technology_mentions": [
      "electric hydraulic fracturing (e-frac)",
      "super spec drilling rig",
      "DUC inventory optimization"
    ],
    "completions_strategy": "Single full-time electric frac crew year-round plus a spot crew in Q2-Q3 to harvest DUC inventory. Achieved 9.7 frac stages/day benchmark in 2025 (approaching 10 stages/day in Q4). New two-year e-frac fleet agreement starting Jan 1, 2026. D&C pricing flat to slightly lower vs. 2025. 500,000+ lateral feet of DUC inventory provides multi-year completion flexibility.",
    "service_provider_mentions": [],
    "efficiency_metrics": "9.7 frac stages per day (2025 benchmark), approaching 10 stages/day in Q4. ~3,800 total frac stages completed in 2025. D&C pricing flat to slightly lower for 2026. Sub-$600M capex could maintain 2.6+ Bcfe/d in 2028.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Range is running an e-frac fleet under long-term contract and achieving industry-leading frac stage efficiency. While focused on capital efficiency rather than technology experimentation, their completions-intensive DUC harvest strategy and e-frac adoption indicate digital completions awareness. No CLF or frac diagnostics mentions.",
    "notable_quote": "Completion efficiencies for the fourth quarter approached 10 frac stages per day per crew, pushing 2025 totals to nearly 3,800 total stages.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "SLB",
    "company": "SLB (Schlumberger)",
    "segment": "Oilfield Services — Diversified Major",
    "quarter": "Q4 2025",
    "transcript_url": "MarketBeat highlights summary",
    "strategy_summary": "SLB delivered record digital performance in Q4 with $825M digital revenue (+25% sequential), ARR exceeding $1B, and launched Tela — an agentic AI system for upstream workflows. ChampionX integration drives Production Systems growth. Data center solutions business targeting $1B annual run rate by end-2026. 2026 revenue guidance $36.9-37.7B with margin in-line with 2025.",
    "capex_guidance": "$36.9-37.7B revenue guidance 2026; $2.4B capex investments",
    "basin_focus": [
      "Global (North America, Latin America, Middle East, Asia, Europe/Africa)",
      "Venezuela (unique operating license)",
      "Saudi Arabia (drilling/workover rebound)"
    ],
    "technology_mentions": [
      "Tela agentic AI system (upstream workflows)",
      "ADNOC AI-powered production system optimization (partnership)",
      "OneSubsea (subsea bookings $4B in 2025)",
      "ChampionX integration (production systems, artificial lift)",
      "Digital ARR >$1B (15% YoY growth)",
      "Data center solutions (cooling/infrastructure)",
      "Lumi platform (digital)",
      "500+ subsea trees to be awarded 2026-2027"
    ],
    "completions_strategy": "SLB's completions exposure is primarily through Production Systems (ChampionX integration) and Well Construction. Real-time completions diagnostics are not highlighted — focus is on production recovery, digital, and subsea. Completion services in North America land declined due to macro headwinds.",
    "service_provider_mentions": [
      "ChampionX (acquired)",
      "ADNOC (partnership)",
      "NextDecade (LNG service)",
      "Cheniere (LNG service)"
    ],
    "metrics_reported": {
      "Q4_revenue": "$9.7B (+9% seq)",
      "Q4_digital_revenue": "$825M (+25% seq)",
      "Q4_digital_pretax_margin": "34%",
      "digital_ARR": ">$1B",
      "FY2025_FCF": "$4.1B",
      "net_debt": "$7.4B",
      "shareholder_returns_2025": "$4.0B",
      "FY2026_revenue_guidance": "$36.9-37.7B",
      "FY2026_adj_EBITDA_guidance": "$8.6-9.1B"
    },
    "seismos_relevance": "Medium",
    "seismos_relevance_detail": "SLB is a primary competitive reference point — their digital division (Tela agentic AI, $1B+ ARR) competes in the same intelligent completions/production optimization space as Seismos. Halliburton's Zeus IQ is the direct CLF competitor; SLB's Tela is the broader digital intelligence competitor. SLB's emphasis on 'production recovery as critical domain for value creation' and ADNOC AI partnership shows the direction of large OFS digital strategies. SLB is both a competitive benchmark and a potential enterprise partner/acquirer context to track.",
    "notable_quote": "We launched Tela, an agentic AI system for upstream workflows, as we target exiting 2026 at a $1 billion annual run rate in our data center solutions business."
  },
  {
    "ticker": "SM",
    "company": "SM Energy Company",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "SM Energy is transitioning to a 'value over volume' strategy following the Civitas Resources merger, cutting capex 14% and reducing from 14 to 11 average rigs while targeting $200-300M in annual cost synergies. The company is divesting South Texas assets for $950M and concentrating capital on the Permian (45%) with growing Uinta and DJ Basin positions.",
    "capex_guidance": "$2.65B-$2.85B total ($2.3B-$2.5B DC&E); 14% lower than pro forma 2025",
    "production_guidance": "H2 2026: 420,000-430,000 BOE/d at 55% oil",
    "basin_focus": [
      "Permian Basin (45% of capital)",
      "DJ Basin (20%)",
      "Uinta Basin (20%)",
      "South Texas (15%, divesting)"
    ],
    "technology_mentions": [
      "longer laterals",
      "deeper zone development",
      "multi-stack pay development (Uinta)"
    ],
    "completions_strategy": "Deploying 4.5 frac crews across portfolio. Drilling 245 net wells and completing 295 net wells in 2026. Applying proven technical capabilities from Permian to Uinta Basin with multiple stack pays. Integrating Civitas operations with focus on applying best practices across combined asset base. No specific advanced frac technology mentioned.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Record operating cash flow of $2.01B. Record adjusted EBITDAX of $2.26B (+13% YoY). Net production up 21% YoY to 206.8 MBoe/d. Expected $200-300M annual cost synergies from Civitas merger with $1.0-1.5B NPV-10 value creation. Net debt reduced by $437M in 2025.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Large-scale multi-basin operator with 4.5 frac crews and 295 net completions planned in 2026. Permian receives 45% of capital. Active focus on applying best practices and increasing operational efficiencies across combined Civitas portfolio. However, no specific advanced completions technology mentions beyond longer laterals and deeper zones.",
    "notable_quote": "This is the first release of the new SM Energy. 2025 was a pivotal year in which the company improved on every part of our investment thesis.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "WCP",
    "company": "Whitecap Resources",
    "segment": "Operator - International (Canada Montney/Conventional)",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "Whitecap completed its 'transformational' combination with Veren Inc. and delivered record Q4 production of 379,000 BOE/day with peer-leading operating costs of CAD $12.24/BOE. The Montney unconventional division (Musreau, Lator, Kaybob Duvernay) is ahead of plan with debottlenecked capacity now guided at 115,000-120,000 BOE/day by year-end - two years ahead of prior schedule - driven by 'wine rack' development and artificial lift refinements. 2026 guidance: 370,000-375,000 BOE/day on CAD $2.0-2.1B capex.",
    "capex_guidance": "CAD $2.0-2.1B full year 2026; 2025 full year CAD ~$2.0B",
    "basin_focus": "Montney (Musreau/Lator/Kaybob - unconventional gas/condensate), Saskatchewan/Bakken/Alberta conventional, Duvernay",
    "technology_mentions": "Wine rack development configuration (Kaybob Duvernay - 10-20% well performance improvement), open-hole multilateral drilling (3-mile 8-leg Bakken well, IP90 38% above type curve), artificial lift refinements (gas lift optimization), base optimization, 10-year Centrica TTF gas contract, 10-year Chicago Henry Hub contract",
    "completions_strategy": "Montney: longer laterals, higher-density development, 'wine rack' spacing optimization reducing interference; Bakken: extended-reach open-hole multilateral wells (record 34,600m drilled); Cardium: frac design learnings driving 15% capital efficiency improvement in 2025; Frobisher: longer laterals and enhanced reservoir contact with 41% IP180 outperformance",
    "service_provider_mentions": "Centrica (10-year gas marketing agreement)",
    "metrics_reported": "Q4 production: 379,000 BOE/day; FY2025 funds flow: CAD $2.95/share; FCF: ~CAD $900M; operating costs: CAD $12.24/BOE (11% YoY decrease); net debt: CAD $3.4B (<1x annualized Q4 FF); Musreau: 17,000-18,000 BOE/day at 70% liquids; Kaybob: 7 wine rack pads (33 wells); Lator: 35,000-40,000 BOE/day facility Q4 commissioning",
    "seismos_relevance": "Medium",
    "seismos_relevance_detail": "Whitecap is a significant Canadian Montney operator with an active unconventional completions program. The emphasis on 'wine rack' development optimization, frac design learnings, completion efficiency improvements, and high-density well testing in the Duvernay aligns with CLF/real-time diagnostics applications. While no frac diagnostics are mentioned, Whitecap's scale and technology-forward approach to Montney completions make it a potential target for Seismos Canadian market expansion.",
    "notable_quote": "Kaybob wine rack configuration delivering 10-20% well performance improvement over 33 wells"
  },
  {
    "ticker": "WFRD",
    "company": "Weatherford International plc",
    "segment": "OFS-Diversified",
    "quarter": "Q4 2025",
    "strategy_summary": "Weatherford is navigating a 'tale of two halves' in 2026, expecting a weaker first half followed by recovery driven by contract awards in Saudi Arabia, Argentina, UAE, and Brazil. The company is investing heavily in its Modus MPD solution and completions/interventions portfolio while executing $150M in cost optimization and workforce reductions to protect margins in a flat-to-down international market.",
    "capex_guidance": "$190M-$230M for 2026 (declining at midpoint vs. 2025 $226M)",
    "production_guidance": "N/A",
    "basin_focus": [
      "Permian",
      "Latin America (Mexico, Brazil, Argentina)",
      "Middle East (Saudi Arabia, UAE, Kuwait, Oman)",
      "Asia (Indonesia)",
      "North Africa",
      "Australia",
      "Egypt"
    ],
    "technology_mentions": [
      "Modus MPD (Managed Pressure Drilling)",
      "TRS (Tubular Running Services)",
      "gas-lift completions",
      "flow-control accessories",
      "digital platforms",
      "AI-driven productivity tools",
      "ERP modernization"
    ],
    "completions_strategy": "Advancing completions and interventions capabilities with focus on offshore rebound. Won seven-year Oxy contract for gas-lift completions and flow-control accessories in Oman. Positioning as full-service provider from drilling through completions with MPD and TRS integration.",
    "service_provider_mentions": [
      "Oxy (Occidental)",
      "Turnwell Industries LLC"
    ],
    "efficiency_metrics": "Adjusted EBITDA margin 22.6% (up 74bps sequentially). Free cash flow conversion 43.7% for FY2025 (576bps improvement YoY). $150M personnel expense reductions in 2025. Workforce reduced by 2,000+ employees.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Weatherford is expanding completions and interventions capabilities and investing in digital/AI optimization, but no specific mentions of acoustic sensing, real-time frac monitoring, or CLF technologies. Their completions focus is more on tools (gas-lift, flow-control) than frac diagnostics.",
    "notable_quote": "We believe the worst in Mexico is behind us.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "WTTR",
    "company": "Select Water Solutions, Inc.",
    "segment": "OFS-Water Management",
    "quarter": "Q4 2025",
    "strategy_summary": "Select Water is executing a multi-year infrastructure build-out in the Northern Delaware Basin with 11-year dedicated acreage contracts, while its Chemical Technology segment posted record 19% YoY revenue growth. The company is diversifying into municipal/industrial water, beneficial reuse, and lithium extraction via a partnership with LibertyStream for commercial lithium carbonate production by late 2026.",
    "capex_guidance": "$175M-$225M for 2026 (with $50M-$60M maintenance weighted to Water Services)",
    "production_guidance": "N/A",
    "basin_focus": [
      "Northern Delaware Basin (Eddy County, NM)",
      "Permian Basin"
    ],
    "technology_mentions": [
      "produced water recycling",
      "drag reducer chemistry (DRA)",
      "beneficial reuse",
      "mineral/lithium extraction",
      "advanced chemical technologies",
      "pipeline infrastructure",
      "recycling facilities"
    ],
    "completions_strategy": "Select directly supports completions through water transfer for simul-frac and tri-mod frac operations. Management stated they have higher market share on tri-mod fracs than simul-fracs, and higher on simul-fracs than zippers, noting 'the more complex the solution, that is really where we shine.' Water transfer revenues in New Mexico surged 77% sequentially in Q4.",
    "service_provider_mentions": [
      "LibertyStream Infrastructure Partners"
    ],
    "efficiency_metrics": "Water Infrastructure gross margin before D&A at 54.1%. Water Services gross margin improved 2pp to 20% in Q4. Chemical Technology segment 45% gross profit growth. 1 billion barrels recycled since 2021. 800% Water Infrastructure revenue growth over 5 years. FY2025 revenue $1.4B, Adjusted EBITDA $260.3M.",
    "seismos_relevance": "Medium",
    "seismos_relevance_reason": "Select is deeply embedded in completions operations as a water logistics provider for simul-frac and tri-mod frac, which are the exact well designs where Seismos CLF technology adds value. No direct frac diagnostics or monitoring mentions, but their customer base and operational footprint overlap significantly with Seismos target operators.",
    "notable_quote": "The more complex the solution, that is really where we shine.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "AESI",
    "company": "Atlas Energy Solutions Inc.",
    "segment": "OFS-Logistics",
    "quarter": "Q4 2025",
    "strategy_summary": "Atlas delivered $249M revenue and $36.7M adjusted EBITDA in Q4, with Dune Express achieving record utilization. The company is pivoting aggressively into behind-the-meter power generation with 240MW of equipment on order and a Power-as-a-Service model, positioning power as a growth engine alongside its core Permian proppant and logistics business.",
    "capex_guidance": "~$55M cash capex in 2026 ($45M maintenance, $10M growth) plus ~$190M in progress payments for power assets via lease facility",
    "production_guidance": "N/A",
    "basin_focus": [
      "Permian",
      "Delaware Basin"
    ],
    "technology_mentions": [
      "Dune Express",
      "Power-as-a-Service",
      "microgrid",
      "patented hybrid battery solution",
      "behind-the-meter power"
    ],
    "completions_strategy": "Indirect completions exposure through proppant supply and last-mile logistics to frac crews. Q4 proppant volumes of 5.3M tons with logistics delivering 4.9M tons. Noted Permian completion activity stabilized at $50-60 WTI strip levels after steep summer decline.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Full year 20% adjusted EBITDA margin; Dune Express record Q4 shipments ~2.1M tons with November monthly record of 760K tons; average sand price ~$19.85/ton falling to ~$18/ton in Q1 2026",
    "seismos_relevance": "Low",
    "seismos_relevance_reason": "Proppant and logistics provider with no direct completions technology, frac diagnostics, or real-time monitoring capabilities. Power-as-a-Service pivot is interesting but unrelated to CLF/acoustic sensing.",
    "notable_quote": "Pricing has fallen to completely unsustainable levels, well below those seen during COVID.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "BKR",
    "company": "Baker Hughes",
    "segment": "Oilfield Services — Diversified Major",
    "quarter": "Q4 2025",
    "transcript_url": "MarketBeat highlights summary",
    "strategy_summary": "Baker Hughes delivered record 2025 adjusted EBITDA of $4.83B driven by IET (Industrial & Energy Technology) with $32.4B backlog. OFSE (oilfield services) revenue fell 8% on macro headwinds but maintained ~18% margins. Chart Industries acquisition expected Q2 2026 with $325M synergy target. Path to 20% company EBITDA margin by 2028. Power systems, LNG, and new energy are the growth vectors.",
    "capex_guidance": "$27.25B revenue, $4.85B adj EBITDA 2026 guidance; Chart acquisition Q2 2026",
    "basin_focus": [
      "Global — Middle East (Kuwait, PDO, ADNOC)",
      "Sub-Saharan Africa",
      "Brazil",
      "North Sea (declining)",
      "Mexico (declining)"
    ],
    "technology_mentions": [
      "Leucipa digital production optimization platform",
      "AccessESP (electric submersible pumps with digital monitoring)",
      "Cordant Solutions (asset integrity/inspection, double-digit order growth)",
      "NovaLT industrial gas turbines (~2 GW orders, data center applications)",
      "Chart Industries acquisition (gas processing/LNG equipment)",
      "Advanced ESP systems with digital monitoring services"
    ],
    "completions_strategy": "Baker Hughes's OFSE completions exposure is primarily through production solutions (ESP systems, Leucipa) and subsea pressure systems. North America land completions are not a strategic focus — the company is pivoting toward IET, LNG, power systems, and production recovery globally. OFSE NA land segment facing continued softness.",
    "service_provider_mentions": [
      "Chart Industries (acquisition target)",
      "Kuwait Oil Company (contract)",
      "PDO (contract)",
      "ADNOC (contract)",
      "Cactus (SSPS JV)",
      "Coral North LNG (Mozambique)"
    ],
    "metrics_reported": {
      "FY2025_adj_EBITDA": "$4.83B (record)",
      "FY2025_FCF": "$2.7B (57% conversion)",
      "IET_backlog": "$32.4B (record)",
      "IET_orders_2025": "$14.9B (record)",
      "OFSE_revenue_2025": "$14.3B (-8% YoY)",
      "OFSE_margin_2025": "18.3%",
      "FY2026_revenue_guidance": "$27.25B",
      "FY2026_adj_EBITDA_guidance": "$4.85B",
      "cash_and_liquidity": "$3.7B cash, $6.7B total liquidity"
    },
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "Baker Hughes's primary OFS focus is pivoting away from North America land completions toward IET, LNG, and production recovery globally. Leucipa and AccessESP are production optimization tools (post-frac), not real-time completions diagnostics. No CLF, acoustic, or downhole completion intelligence mentioned. Chart acquisition further shifts the portfolio toward processing equipment. BKR is not a near-term competitive or customer priority for Seismos.",
    "notable_quote": "IET more than offset OFSE softness — we achieved record $14.9 billion of IET orders and a $32.4 billion backlog, putting us on track for our 20% company EBITDA margin target by 2028."
  },
  {
    "ticker": "CHX",
    "company": "ChampionX Corporation",
    "segment": "OFS-Chemical",
    "quarter": "Q4 2024",
    "strategy_summary": "ChampionX reported its final standalone quarter before being acquired by SLB. The company focused on cash flow generation and margin expansion, delivering $912M revenue with 23.3% adjusted EBITDA margin. The SLB all-stock acquisition closed shortly after, ending CHX as an independent entity.",
    "capex_guidance": "N/A (no 2026 standalone guidance given pending SLB acquisition)",
    "production_guidance": "N/A",
    "basin_focus": [
      "Global"
    ],
    "technology_mentions": [
      "Production Chemical Technologies",
      "Production & Automation Technologies",
      "Reservoir Chemical Technologies",
      "artificial lift"
    ],
    "completions_strategy": "Limited direct completions exposure. Reservoir Chemical Technologies segment (stimulation/completion chemicals) grew 7% sequentially to $21.9M on higher product volumes, but represents a small fraction of total revenue.",
    "service_provider_mentions": [
      "SLB"
    ],
    "efficiency_metrics": "Adjusted EBITDA margin 23.3%; free cash flow $170.1M in Q4; full year FCF $460.5M on $589.7M operating cash flow",
    "seismos_relevance": "Low",
    "seismos_relevance_reason": "Production chemicals and artificial lift focus with minimal completions technology overlap. Now part of SLB, which has its own frac diagnostics capabilities.",
    "notable_quote": "The unique nature of ChampionX's cash flow resiliency, driven by the strength of our high-margin operating model and capital-light portfolio of businesses.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "CNQ",
    "company": "Canadian Natural Resources Limited",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "CNQ's Q4 2025 and full-year results are scheduled for March 5, 2026 (not yet available as of February 27, 2026). Based on Q3 2025, the company achieved record quarterly production of 1,620,261 boe/d (+19% YoY), with oil sands mining running at 104% utilization producing 581,136 bbl/d SCO. The company increased 2025 full-year guidance to 1,560,000-1,580,000 boe/d with unchanged capex of CAD $5.9 billion and has increased its dividend for 25 consecutive years.",
    "capex_guidance": "CAD $5.9 billion operating capital for 2025 (unchanged through Q3 2025). Focused on oil sands mining and in situ thermal SAGD development. Multiple SAGD pads planned for 2026 production (Kirby Q4 2025, Pike Q1-Q2 2026). Naphtha Recovery Unit Tailings Treatment (NRUTT) project targeted for mechanical completion Q3 2027 adding ~6,300 bbl/d SCO.",
    "production_guidance": "2025 guidance increased to 1,560,000-1,580,000 boe/d. Q3 2025 record: 1,620,261 boe/d. Oil Sands Mining SCO: 581,136 bbl/d at 104% utilization; target ~592,000 bbl/d capacity post-AOSP acquisition integration. Thermal in situ record: ~271,000 bbl/d. 2026 formal guidance expected March 5, 2026.",
    "basin_focus": [
      "Athabasca Oil Sands (Alberta, Canada)",
      "Horizon Oil Sands",
      "Albian Sands (AOSP)",
      "Kirby (thermal in situ)",
      "Jackfish (thermal in situ)",
      "Pike (thermal in situ)",
      "Primrose (thermal in situ)"
    ],
    "technology_mentions": [
      "Solvent Enhanced Oil Recovery (SAGD solvent injection) at Kirby North and Primrose",
      "Steam-Assisted Gravity Drainage (SAGD) pad completions",
      "Reliability Enhancement Project (Horizon - bi-annual turnaround shift)",
      "Debottleneck Project (Scotford Upgrader +8,000 bbl/d)",
      "Naphtha Recovery Unit Tailings Treatment (NRUTT)"
    ],
    "completions_strategy": "CNQ's completions activity is focused on SAGD well-pair drilling and steam injection startup for thermal in situ assets, not hydraulic fracturing. Solvent-enhanced oil recovery is being piloted at Kirby North (started June 2024) and Primrose to reduce steam-to-oil ratios and improve recovery factors. Conventional frac completions apply to light oil assets in the Western Canadian Sedimentary Basin but were not highlighted in recent earnings calls.",
    "service_provider_mentions": [],
    "efficiency_metrics": "SCO operating cost: CAD $21.29/bbl (Q3 2025) and CAD $20.97/bbl (Q4 2024). Oil sands utilization 104%. Thermal in situ: ~$11.04/bbl operating cost. Net debt-to-EBITDA 0.9x. Liquidity >CAD $4.3 billion. Production growth per share: 16% in 2025 vs 2024. Shareholder returns: CAD $6.2 billion YTD through Q3 2025.",
    "seismos_relevance": "Low",
    "seismos_relevance_reason": "CNQ is primarily an oil sands and heavy oil producer. Its completions activity is dominated by SAGD (steam injection) rather than hydraulic fracturing. Real-time frac monitoring and CLF technology are not applicable to its core asset base. The company's technology focus is on solvent EOR, upgrader efficiency, and mining operations.",
    "notable_quote": "Q3 2025: CNQ President Scott Stauth referenced 'record quarterly production of 1.62 million BOE/d' and the company reported 'solvent recoveries continue to meet expectations' at Kirby North solvent SAGD pilot.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "CNX",
    "company": "CNX Resources Corporation",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "CNX is maintaining flat production through 2026 with front-half weighted capital (~60% in H1) while completing approximately five deep Utica laterals at ~$1,700/ft drilling cost with two spacing tests at 1,300 ft and 1,500 ft underway. The company fully internalized its AutoSep technology for flowback operations and has outsourced commercialization to a third-party OFS company expanding across Appalachia. RNG and 45Z tax credits represent ~$30M/year run-rate potential.",
    "capex_guidance": "2026 capital front-half weighted (~60% H1); flat production profile ~7.5 Bcf/d equivalent; no specific dollar figure provided in transcript",
    "basin_focus": "Appalachian Basin (Marcellus and deep Utica in SW Pennsylvania, West Virginia, Ohio); Haynesville (not mentioned — CNX is Appalachia-only)",
    "technology_mentions": "AutoSep (proprietary gas/liquid separator technology for flowback — cost savings + safety + environmental); deep Utica program with spacing tests at 1,300 ft and 1,500 ft; Evolution e-frac not mentioned in this transcript",
    "completions_strategy": "~5 deep Utica lateral completions in 2026; Utica drilling cost $1,700/ft; spacing evaluation (1,300 ft vs 1,500 ft tests underway); Marcellus inventory harvesting in SW Pennsylvania; front-half capital weighting preserves H2 acceleration optionality",
    "service_provider_mentions": "AutoSep commercialization outsourced to unnamed OFS company for Appalachian rollout; Evolution e-frac not named in transcript",
    "metrics_reported": "Utica drilling cost $1,700/ft; 2027 hedged ~60% toward 80% target at ~$4 NYMEX weighted avg; 45Z tax credit potential ~$30M/year run-rate; coal mine methane volume stable (20+ year mine life)",
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "CNX operates exclusively in Appalachia (Marcellus/Utica), which is outside Seismos' primary target basins (Permian, Eagle Ford, Haynesville). No frac diagnostics, real-time completions monitoring, or CLF technology mentioned. AutoSep is a flowback tool, not a frac diagnostic. Evolution e-frac partnership (known from other sources) not referenced in this transcript.",
    "notable_quote": "AutoSep is fully internalized — cost savings, environmental and safety benefits confirmed"
  },
  {
    "ticker": "CVE",
    "company": "Cenovus Energy",
    "segment": "Operator - International (Canada Oil Sands/Offshore)",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "Cenovus set upstream production records in 2025 at 918,000 BOE/day in Q4, driven by the ~$15B MEG Energy acquisition integrating Christina Lake North. Strategy focuses on oil sands SAGD brownfield development, West White Rose offshore commissioning, and capturing $400M+ annual synergies from MEG by 2028. Solvent-enhanced oil recovery (SAGD + condensate injection) is being piloted at Spruce Lake North.",
    "capex_guidance": "~$4.9B full year 2025; 2026 growth spend ~$300M lower YoY; sustaining ~$3.6-3.7B; no major new megaprojects",
    "basin_focus": "Alberta Oil Sands (Christina Lake, Foster Creek, Sunrise, Lloydminster), West White Rose (Atlantic offshore), South China Sea (Liwan gas)",
    "technology_mentions": "Solvent-enhanced oil recovery (condensate + steam, Spruce Lake North FID ~$250M), delineation/seismic programs on Christina Lake North, redevelopment well programs, SAGD well pad optimization, wider spacing/longer wells development methodology",
    "completions_strategy": "SAGD thermal recovery focused - 42-well redevelopment program at Christina Lake North starting 2026; wider well spacing and longer wells deployment; Lloydminster redevelopment wells outperforming; no hydraulic fracturing focus",
    "service_provider_mentions": "None named",
    "metrics_reported": "Q4 upstream production: 918,000 BOE/day record; oil sands: 727,000 BOE/day; Christina Lake: 309,000 bbl/day; Foster Creek: 220,000 bbl/day record; oil sands nonfuel opex: $8.39/bbl; downstream utilization: 95%; net debt: ~$8.3B",
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "Cenovus is a Canadian oil sands SAGD operator with no hydraulic fracturing completions business. Their technology focus is on thermal recovery, solvent injection, and SAGD optimization - not relevant to Seismos surface acoustic sensing, CLF, or frac diagnostics. Offshore and China gas assets also have no frac applications.",
    "notable_quote": "Achieved record oil sands production of 727,000 BOE per day in Q4"
  },
  {
    "ticker": "CVX",
    "company": "Chevron Corporation",
    "segment": "Major",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "Chevron achieved record global and U.S. production in 2025, driven by Tengiz FGP startup and Permian reaching 1 MMboe/d, while focusing on free cash flow growth and capital efficiency. Cost reduction program exceeded expectations delivering $1.5B in 2025 with an expanded $3-4B target by end-2026. Portfolio strengthening via Hess acquisition and Eastern Mediterranean gas growth anchor 2026 outlook.",
    "capex_guidance": "Organic CapEx $5.1B Q4 2025; full-year 2025 in line with guidance; 2026 production growth 7-10% YoY",
    "basin_focus": "Permian (~1 MMboe/d), Gulf of Mexico (target 300k boe/d 2026), Tengiz Kazakhstan, Eastern Mediterranean, Bakken",
    "technology_mentions": "Efficiency gains in shale cited broadly; no specific completions technology named",
    "completions_strategy": "Applying best practices to Bakken post-Hess; ongoing Permian efficiency optimization; capital efficiency driving 35%+ FCF growth YoY",
    "service_provider_mentions": "None mentioned specifically",
    "metrics_reported": "Q4 earnings $2.8B ($1.39/sh adjusted $3.0B/$1.52); Q4 OCF $10.8B; full-year adjusted FCF ~$20B; Permian 1 MMboe/d; record production globally",
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "No mention of completions diagnostics, CLF, real-time frac monitoring, or surface acoustics. Permian efficiency language is generic. No Seismos or competitor technology named.",
    "notable_quote": "2025 was a year of execution with record production globally"
  },
  {
    "ticker": "EQNR",
    "company": "Equinor ASA",
    "segment": "Major",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "Equinor cut 2026-27 CapEx by ~$4B (mainly power/low-carbon) while maintaining oil and gas investment near $10B/year to bolster free cash flow, with organic CapEx guided at ~$13B in 2026. The company reported record production of 2,137 Mboe/d in 2025 (up 3.4% YoY) and guided for ~3% production growth in 2026 driven by new field ramp-ups. Portfolio high-grading included divestiture of Argentina onshore assets and formation of the Adura JV with Shell on the UK Continental Shelf.",
    "capex_guidance": "Organic CapEx ~$13B in 2026; ~$9B in 2027; oil and gas investment maintained ~$10B/year",
    "basin_focus": "Norwegian Continental Shelf (14 discoveries, ~30 exploration wells planned 2026); Brazil; UK (Adura JV/Rosebank); Argentina (divested onshore); Empire Wind offshore (US)",
    "technology_mentions": "No completions or frac-specific technology mentioned; advanced seismic technology and subsurface imaging for exploration cited generically",
    "completions_strategy": "Equinor is an offshore-focused international major with no U.S. onshore shale completions activity described; NCS exploration and production via vertical wells and subsea tiebacks",
    "service_provider_mentions": "Shell (Adura JV partner); no completions vendors named; Reveal Energy not mentioned",
    "metrics_reported": "FY2025 production 2,137 Mboe/d (+3.4%); ROACE 14.5%; CFO after tax $18B; EPS $0.81; renewables generation 5.65 TWh (+25% YoY); 3-year average RRR 100%",
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "Equinor is noted as a Reveal Energy frac diagnostics funder, but this transcript contains zero mention of frac diagnostics, completions technology, acoustic sensing, or U.S. unconventional activity. Equinor operates offshore and internationally. Reveal Energy connection is background context not reflected in this transcript.",
    "notable_quote": "Record production in 2025 driven by operational performance and new fields"
  },
  {
    "ticker": "EQT",
    "company": "EQT Corporation",
    "segment": "E&P Operator",
    "quarter": "Q4 2025",
    "transcript_url": "InsiderMonkey full transcript",
    "strategy_summary": "EQT is focused on Appalachian natural gas with a $2.07-2.21B maintenance capex program. Combo development (6-10 wells sequentially per site) achieved 13% well cost reduction per foot year-over-year and recorded fastest quarterly completion pace. 80% water piped infrastructure. AI tools deployed for service rebidding and compression optimization.",
    "capex_guidance": "$2.07-2.21B maintenance capex 2026",
    "basin_focus": [
      "Appalachian Basin (Marcellus, Utica)"
    ],
    "technology_mentions": [
      "Combo development (6-10 wells per pad, sequential completions)",
      "AI tools for service contract rebidding",
      "Compression optimization AI",
      "Water infrastructure (80% piped)",
      "Extended laterals"
    ],
    "completions_strategy": "Combo development is EQT's primary efficiency driver — running 6-10 wells per site sequentially to maximize crew efficiency and reduce mobilization costs. Achieved fastest quarterly completion pace on record and 13% lower well cost per foot YoY. Focus is on operational throughput and scale efficiency rather than real-time diagnostics.",
    "service_provider_mentions": [
      "Unnamed completion service providers",
      "rebid via AI-assisted procurement"
    ],
    "metrics_reported": {
      "FY2026_maintenance_capex": "$2.07-2.21B",
      "well_cost_reduction_YoY": "13% per foot",
      "water_piped": "80%",
      "combo_wells_per_site": "6-10",
      "completion_pace": "fastest quarterly pace on record"
    },
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "EQT's Appalachian gas focus and combo development model prioritize throughput efficiency over real-time diagnostics. The 13% well cost reduction achieved without explicit CLF tools suggests they have other levers. However, EQT's scale (6-10 well pads, fastest completion pace) means perf efficiency during plug-and-perf operations could be a pain point worth exploring. Appalachian is not Seismos's current primary market (Permian-focused). AI procurement tools suggest cost sensitivity in vendor selection.",
    "notable_quote": "Combo development allowed us to achieve the fastest quarterly completion pace in our history and a 13% reduction in well cost per foot year-over-year."
  },
  {
    "ticker": "FTI",
    "company": "TechnipFMC plc",
    "segment": "OFS-Completions",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "TechnipFMC reported 9% revenue growth to $9.9B and 33% EBITDA growth to $1.8B in 2025, driven by record Subsea inbound of $10.1B and a growing 24-month opportunity list of ~$29B. The company guided to $9.4B Subsea revenue in 2026 at 21.5% EBITDA margin (+16% EBITDA YoY), with CapEx of ~$340M and FCF of $1.3-1.45B while returning 70%+ to shareholders. Surface Technologies (which includes wellhead and completion equipment) grew international share to 65% with Saudi Arabia and Abu Dhabi manufacturing investments.",
    "capex_guidance": "FY2026 CapEx ~$340M (~3.1% of revenue); Subsea revenue ~$9.4B; Surface Technologies revenue >$1.2B; FCF $1.3-1.45B",
    "basin_focus": "Subsea: Gulf of Mexico (Paleogene — Tiber/Kaskida iEPCI for BP; 5 of 6 '20K' projects awarded), Brazil, North Sea, Asia Pacific; Surface: Saudi Arabia, Abu Dhabi (local manufacturing), North America (challenging)",
    "technology_mentions": "iEPCI (integrated EPCI model eliminating traditional phases); Subsea 2.0 (configure-to-order seabed equipment reducing cycle time); '20K' high-pressure deepwater systems; configure-to-order expanding to SURF/water column; direct awards and portfolio approach by operators; industrialization and standardization initiatives",
    "completions_strategy": "TechnipFMC's Surface Technologies segment covers wellhead and completion equipment (surface trees, wellheads, intervention) but not hydraulic fracturing pumping or diagnostics. North America Surface is described as a 'challenging market' and the company is de-emphasizing it in favor of international.",
    "service_provider_mentions": "BP (Tiber/Kaskida iEPCI; Bumerangue future potential); no U.S. onshore completions vendors named",
    "metrics_reported": "FY2025 revenue $9.9B (+9%); adj EBITDA $1.8B (+33%); FCF $1.45B; Subsea inbound $10.1B; backlog $15.9B; 24-month opportunity list ~$29B (record); shareholder distributions $1.0B (2x prior year); net cash $602M",
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "TechnipFMC is a subsea and offshore-focused OFS company. Its Surface Technologies segment covers wellheads and completion equipment internationally, not U.S. onshore hydraulic fracturing or frac diagnostics. North America surface is explicitly a challenging/de-prioritized market. No overlap with Seismos CLF, SAFA, or Machina product lines.",
    "notable_quote": "Five of the six 20K projects sanctioned to date have been awarded to TechnipFMC"
  },
  {
    "ticker": "HP",
    "company": "Helmerich & Payne, Inc.",
    "segment": "OFS-Drilling",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "H&P reported solid Q4 with 141 contracted U.S. rigs and expanded Permian market share (33% to 37%) despite industry rig count decline, while completing KCAD acquisition to become the largest active land driller globally. The company is investing in rig floor automation (HexGrips, slip lifters), drilling automation, and advanced digital solutions (20% increase in app usage per rig YoY), with 50% of rigs on performance-based contracts. Saudi Arabia rig reactivations (7 rigs) and international expansion are key 2026 growth drivers.",
    "capex_guidance": "Fiscal 2026 gross CapEx $280-320M; maintenance/fleet upgrades/reactivations $230-250M; NAS technology upgrades $40-60M; R&D ~$25M",
    "basin_focus": "Permian Basin (primary; 37% market share), Haynesville (3 to 8 rigs during 2025), Northeast, Saudi Arabia (17 to 24 active rigs with reactivations), Oman, Kuwait, Argentina, Australia (Beetaloo)",
    "technology_mentions": "Rig floor automation (HexGrips, slip lifters); drilling automation; advanced digital solutions (20% app usage increase per rig); 1M lb setback upgrades, high-torque top drives; 40%+ of wells are 3-mile+ laterals; performance-based contracts (50% of fleet); PACE-X Ultra rig (10,000 PSI, high-torque HPU); R&D ~$25M focused on drilling automation, wellbore quality, power management",
    "completions_strategy": "H&P is a drilling contractor; no completions services. Focus is on well design supporting longer laterals and cleaner handoff to completion crews. 'Setting up for a clean and efficient completion' cited explicitly.",
    "service_provider_mentions": "Tamboran Resources and Liberty Energy (Australia Beetaloo mentioned as partners); no completions vendors named",
    "metrics_reported": "Q4 revenues >$1B (third consecutive); 141 contracted rigs Q4 avg; 144 rigs at Q4 exit; Permian share 33%->37%; average lateral length +5%; footage/day +5%; 40%+ of wells >3-mile laterals; $543M operating cash flow FY2025; $210M term loan paid down",
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "H&P is a drilling contractor with no completions services. However, their explicit mention of 'setting up for a clean and efficient completion' and growing longer laterals is contextually relevant — longer laterals require more precise frac diagnostics. H&P's performance-based contract model also aligns with Seismos' outcomes-based CLF approach. Not a direct Seismos customer target but relevant as a drilling partner feeding wells into CLF-capable completion operations.",
    "notable_quote": "Setting them up for a clean and efficient completion and production process"
  },
  {
    "ticker": "NBR",
    "company": "Nabors Industries Ltd.",
    "segment": "OFS-Drilling",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "Nabors reduced net debt by $554M to lowest since 2005 and improved net leverage to ~1.7x through the Parker Wellbore acquisition (and Quail Tools sale), while growing Lower 48 rig count to 66 with 20% of rigs gas-directed (Haynesville/Northeast). SANAD JV in Saudi Arabia continues deploying new-build rigs (14 by Q4, 5 more in 2026 toward 19 total), and NDS (drilling solutions) outperformed the market with 10% sequential Q4 revenue growth on third-party rigs. 4-mile lateral wells in Permian driving demand for high-spec PACE-X Ultra rigs.",
    "capex_guidance": "FY2026 CapEx $737-760M including $360-380M SANAD new-builds; Q1 2026 CapEx $170-180M; NDS EBITDA target $160-170M (+6-7% normalized for Quail)",
    "basin_focus": "Lower 48: Permian (4 rigs added Q4), Eagle Ford (3 added), Haynesville (2 added); gas-directed 20% of L48 fleet; internationally: Saudi Arabia (SANAD), Argentina (14 rigs), Mexico (platform rigs), Oman, Colombia, Venezuela (5 idle rigs, potential restart)",
    "technology_mentions": "PACE-X Ultra rig (10,000 PSI, high-torque HPU, full automation package, MPD integration, casing running); NDS automation package; managed pressure drilling (MPD); casing running; performance software; three-bite wrench (new CAN rig wrench with sensors/automation); RZR rig autonomous drilling; 3-4 mile lateral drilling capability; 7 NDS services per rig average",
    "completions_strategy": "Nabors is a drilling contractor; no completions pumping services. NDS provides casing running and MPD which interface with completion setup. Longer laterals (3-4 mile in Permian, 25% of fleet in 2025 vs 15-16% in 2024) demand higher-spec rigs. PACE-X Ultra deployed for Coterra 4-mile lateral wells in South Texas.",
    "service_provider_mentions": "Coterra Energy (PACE-X Ultra customer); Parker Wellbore (acquired); Quail Tools (divested to Superior); SANAD (Saudi Aramco JV); no frac vendors named",
    "metrics_reported": "FY2025 revenue $3.2B (+8.7%); adjusted EBITDA $913M; Q4 EBITDA $222M; L48 rig count 62 exit Q4, 66 current; International 93.3 avg Q4; NDS Q4 revenue on third-party rigs +10% QoQ; net debt down $554M to lowest since 2005; net leverage ~1.7x",
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "Nabors is a drilling contractor with an NDS technology solutions arm. No completions diagnostics, frac monitoring, or acoustic sensing mentioned. However, the 4-mile lateral trend in Permian Nabors is enabling is directly relevant to Seismos' completions market — longer laterals are harder to frac efficiently without real-time diagnostics. Not a direct customer but feeds the market Seismos serves.",
    "notable_quote": "4-mile laterals in Permian quadrupled as a percentage of our fleet in 2025"
  },
  {
    "ticker": "NOG",
    "company": "Northern Oil and Gas, Inc.",
    "segment": "Operator",
    "quarter": "Q4 2025",
    "strategy_summary": "NOG is scaling its non-operated model across multiple basins with a dual-scenario 2026 outlook tied to commodity prices, leveraging its Drakkar analytics platform to evaluate 200+ ground game deals per quarter. The company closed a major Utica acquisition and is preserving high-value development for a higher price environment while maintaining flexibility through commodity price triggers in JDAs.",
    "capex_guidance": "$850M-$1,100M (low/high activity scenarios)",
    "production_guidance": "139,000-148,000 Boe/d (oil: 68,000-76,000 Bbls/d)",
    "basin_focus": [
      "Permian",
      "Williston",
      "Appalachia",
      "Uinta"
    ],
    "technology_mentions": [
      "Drakkar intelligence platform",
      "upsized completion designs",
      "refrac execution"
    ],
    "completions_strategy": "Non-operator model means NOG does not control completions directly. Noted operators deferred completions due to commodity pricing in Q4. Uinta Basin benefited from upsized completion designs driving 18.5% sequential volume growth. Williston showed improved refrac execution. Q4 capital allocation: 44% Permian, 26% Williston, 8% Uinta, 22% Appalachian.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Q4 recycle ratio of 1.8x. LOE expected $9.45-$10.10/Boe. Full-year D&C capital ~$1B. 24.2 net wells added to production in Q4. Every $5/bbl oil increase adds $100-150M cash flow.",
    "seismos_relevance": "Low",
    "seismos_relevance_reason": "As a non-operator, NOG does not control completions design or frac technology selection. No mentions of CLF, acoustic sensing, real-time frac monitoring, or frac diagnostics. Their operators may use such technologies but NOG does not drive those decisions.",
    "notable_quote": "We pushed and preserved high-value development for a higher price environment.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "OXY",
    "company": "Occidental Petroleum",
    "segment": "E&P Operator",
    "quarter": "Q4 2025",
    "transcript_url": "MarketBeat highlights summary",
    "strategy_summary": "Occidental is executing a lower-capital 2026 program ($5.5-5.9B) following OxyChem sale proceeds used for aggressive deleveraging. Record 2025 production of 1.4M BOE/d. Targeting ~7% lower well costs, 5% lower facility costs, 4% domestic opex reduction. 70% of O&G capex directed to US onshore. Stratos DAC Phase I expected online Q2 2026.",
    "capex_guidance": "$5.5-5.9B total 2026 (down $550M from 2025 ex-OxyChem)",
    "basin_focus": [
      "Permian Basin (primary)",
      "Gulf of America",
      "Permian EOR",
      "International (Middle East, LatAm)"
    ],
    "technology_mentions": [
      "Lightweight proppant (implied via well cost reductions)",
      "EOR technology (Permian CO2 EOR)",
      "Stratos direct air capture (CCS)",
      "Organic reserves replacement ratio: 107%"
    ],
    "completions_strategy": "Summary-level only — 7% lower well costs and 5% lower facility costs indicate completions efficiency improvements but no specific technology details disclosed. 70% US onshore focus with $400M reduction in US onshore spend versus 2025 due to efficiency gains.",
    "service_provider_mentions": [
      "Berkshire Hathaway (preferred equity holder/OxyChem buyer context)"
    ],
    "metrics_reported": {
      "FY2025_production": "1.4M BOE/d (record)",
      "FY2025_FCF": "$4.3B (before working capital)",
      "FY2026_capex": "$5.5-5.9B",
      "FY2026_production": "~1.45M BOE/d",
      "well_cost_reduction_2026": "~7%",
      "facility_cost_reduction_2026": "~5%",
      "domestic_opex_reduction_2026": "~4%",
      "debt_repaid_2025": "$4B",
      "principal_debt": "~$15B"
    },
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "Transcript is a highlights summary with minimal completions technology detail. Well cost reduction targets suggest active optimization efforts, but OXY's scale and internal technical capabilities make it a complex enterprise sales target. No CLF, acoustic, or real-time frac diagnostics mentioned. Permian EOR focus is a different completion profile than conventional plug-and-perf shale fracs where SAFA is most applicable.",
    "notable_quote": "Despite oil prices being down about 14% from 2024, Occidental generated $4.3 billion in free cash flow before working capital — a testament to our cost discipline and operational execution."
  },
  {
    "ticker": "PAM",
    "company": "Pampa Energia S.A.",
    "segment": "International",
    "quarter": "Q4 2025",
    "strategy_summary": "Pampa Energia's Q4 2025 earnings were released March 2, 2026; full transcript details not yet widely indexed. Based on Q3 2025 data, the company reported adjusted EBITDA of $322 million (+16% YoY), achieved all-time high gas production of ~18 million cubic meters/day, and was targeting oil production of 18,000-19,000 bbl/d exit rate for Q4 2025 at Rincon de Aranda. The company is investing $800 million in Rincon de Aranda in 2025 alone as part of a $1.5 billion plan through 2027.",
    "capex_guidance": "$800 million allocated to Rincon de Aranda block in 2025; total $1.5 billion investment plan for Rincon de Aranda through 2027. $426 million oil and gas treatment plant at Rincon de Aranda under construction, expected operational in 2026. Company anticipated negative free cash flow in both 2025 and 2026 due to high capex cycle.",
    "production_guidance": "Oil: targeting 18,000-19,000 bbl/d exit rate Q4 2025 (Rincon de Aranda as main driver); target of 45,000 bbl/d by 2027. Gas: all-time high of ~18 mmcm/d as of Q3 2025. Full year 2025 Q4 results and 2026 guidance expected with March 2, 2026 earnings release.",
    "basin_focus": [
      "Vaca Muerta (Neuquen Basin, Argentina)",
      "Rincon de Aranda block",
      "Sierra Chata block",
      "El Mangrullo block"
    ],
    "technology_mentions": [
      "Oil and gas treatment plant ($426M) at Rincon de Aranda",
      "Vaca Muerta Oil Sur pipeline (VMOS, shared infrastructure)",
      "Shale well testing at Rincon de Aranda"
    ],
    "completions_strategy": "Vaca Muerta shale completions are central to Pampa's growth strategy, particularly at Rincon de Aranda. The company is scaling from exploration/appraisal to full development mode with a major treatment plant investment. No specific completions technology, CLF, or frac diagnostics mentioned in available earnings summaries.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Adjusted EBITDA +16% YoY in Q3 2025 to $322M. Net leverage ratio 1.1x post-Q3 2025. Cash position ~$920 million. Certified shale reserves surged 60% in 2024 to 132 mboe (57% of P1 reserves). Gas production grew 21% YoY in 2024.",
    "seismos_relevance": "Low",
    "seismos_relevance_reason": "Pampa Energia is actively developing Vaca Muerta shale but earnings discussions focus on production targets, infrastructure investment, and financial metrics. No completions technology specifics, frac diagnostics, CLF, or acoustic monitoring mentioned in available call summaries. Company is in development ramp-up phase which could create future opportunity.",
    "notable_quote": "Q3 2025: Management guidance for Q4 2025 oil production was 'between 18,000 and 19,000 barrels per day, with the main driver being Rincon de Aranda.' Company targeting 45,000 bbl/d by 2027.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "PD",
    "company": "Precision Drilling Corporation",
    "segment": "OFS-Drilling",
    "quarter": "Q4 2025",
    "strategy_summary": "Precision Drilling is focused on free cash flow generation and shareholder returns while pursuing international expansion (Saudi Arabia, Kuwait, Argentina MOU). The company is leveraging its Super Triple and Super Single fleet alongside digital technology and Alpha automation to drive rig displacement opportunities in North America.",
    "capex_guidance": "CAD $245 million for 2026 (CAD $182M sustaining/infrastructure, CAD $63M upgrades)",
    "production_guidance": "N/A (drilling services company)",
    "basin_focus": [
      "Western Canada",
      "Permian",
      "Marcellus",
      "Haynesville",
      "Rockies",
      "Saudi Arabia",
      "Kuwait",
      "Argentina"
    ],
    "technology_mentions": [
      "Alpha automation system",
      "Super Triple rigs",
      "Super Single rigs",
      "Tele-Double rigs",
      "digital technology",
      "MWD",
      "LWD",
      "managed pressure drilling",
      "performance contracts"
    ],
    "completions_strategy": "Precision's completion and production segment posted CAD $17M adjusted EBITDA. The company wound down U.S. completion operations in Q2 2025 but maintains Canadian well servicing. Core focus is drilling services, not completions.",
    "service_provider_mentions": [
      "San Antonio International (Argentina MOU partner)"
    ],
    "efficiency_metrics": "Canada daily operating margins CAD $14,132/day. U.S. daily operating margins $8,754/day. International day rates $53,505/day (up 8% YoY). Peak Canadian rig count of 87 rigs in Q1 2026.",
    "seismos_relevance": "Low",
    "seismos_relevance_reason": "Precision Drilling is a drilling contractor, not a completions or frac services company. They wound down U.S. completion operations and their technology focus is on drilling automation (Alpha system) and rig performance, not frac optimization or diagnostics.",
    "notable_quote": "At least half of expected U.S. growth would likely come from displacements rather than customers adding incremental rigs.",
    "data_quality": "Full transcript"
  },
  {
    "ticker": "REI",
    "company": "Ring Energy",
    "segment": "Operator - Small Permian",
    "quarter": "Q4 2024 (NOTE: File contains Q4 2024 data, not Q4 2025)",
    "transcript_url": "local",
    "strategy_summary": "FILE NOTE: REI.txt contains a Zacks Q4 2024 earnings miss summary (March 2025 publication), not a Q4 2025 transcript. Ring Energy missed Q4 2024 EPS ($0.06 vs $0.08 est) and revenues ($83.44M vs est, down from $99.94M YoY). No completions technology or service strategy detail available from this summary article.",
    "capex_guidance": "Not available from this summary",
    "basin_focus": "Permian Basin (small independent)",
    "technology_mentions": "None mentioned",
    "completions_strategy": "Not discussed in this earnings miss summary",
    "service_provider_mentions": "None mentioned",
    "metrics_reported": "Q4 2024 EPS: $0.06 (miss vs $0.08 est); Q4 2024 revenue: $83.44M (miss, down from $99.94M); FY2025 consensus: $0.52 EPS on $385.87M revenue",
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "Ring Energy is a small Permian independent; the file only contains a brief Zacks earnings miss summary with no completions technology discussion. Even with full transcript data, Ring Energy's small scale and cost-constrained position makes it a low-priority Seismos prospect. Potential indirect relevance as a ProFrac customer.",
    "notable_quote": "Missed Q4 2024 EPS by 25%, revenues down from $99.94M to $83.44M year-over-year"
  },
  {
    "ticker": "RES",
    "company": "RPC, Inc.",
    "segment": "OFS-Pumper",
    "quarter": "Q4 2025",
    "strategy_summary": "RPC reported a challenging Q4 2025 with revenue down 5% sequentially and pressure pumping revenue down 6%, driven by December holiday shutdowns and an idled fleet. Management is deliberately pivoting toward less capital-intensive service lines organically and via acquisitions, holding idled frac fleets offline until returns improve, while investing selectively in technology differentiation including natural gas frac pumps and Thru Tubing Solutions.",
    "capex_guidance": "$150-$180 million for 2026 (includes ~$15M of delayed 2025 projects); will flex with activity levels",
    "production_guidance": "N/A - OFS company",
    "basin_focus": [
      "Permian Basin"
    ],
    "technology_mentions": [
      "natural gas frac pump (100% natural gas)",
      "Thru Tubing Solutions",
      "A-10 downhole motor",
      "Metal Max power section",
      "UnPlug technology",
      "custom big bore unit (2026 delivery)"
    ],
    "completions_strategy": "Pressure pumping fleet partially idled with no reactivation timeline until returns improve. Pivoting strategically toward less capital-intensive service lines. Evaluating 100% natural gas frac pump technology. Bright spots in Spinnaker Cementing Solutions, Cudd Pressure Control, snubbing, and well control.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Adjusted EBITDA $55.1M (down ~19% sequentially); EBITDA margin 12.9% (down 230bps); free cash flow $52.9M full-year 2025; $210M cash, zero revolver borrowings",
    "seismos_relevance": "Low",
    "seismos_relevance_reason": "RPC is a direct OFS pumping competitor space - they are a potential customer channel partner or competitive reference, not an end-user. No mentions of CLF, acoustic sensing, real-time frac monitoring, or frac diagnostics on the call. Idled fleets and margin pressure indicate a distressed pumping market, not an expansionary environment for new frac technology adoption.",
    "notable_quote": "The returns just need to improve.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "SEI",
    "company": "Solaris Energy Infrastructure, Inc.",
    "segment": "OFS-Power/Equipment",
    "quarter": "Q4 2025",
    "strategy_summary": "Solaris is executing a strategic pivot from oilfield logistics to behind-the-meter power solutions for AI data centers, with Power Solutions now representing ~70% of earnings and targeting 90%. The company signed a landmark 10-year, 500+ MW contract with an investment-grade global technology company and plans to scale its operated fleet to 2,200 MW by early 2028, projecting $700M-$750M Adjusted EBITDA at full deployment.",
    "capex_guidance": "$770M for 2026 (consolidated, including power fleet expansion; $647M remaining in 2025, $230M in 2027, $150M in 2028)",
    "production_guidance": "N/A",
    "basin_focus": [
      "ERCOT (Texas)",
      "Permian Basin (legacy logistics)"
    ],
    "technology_mentions": [
      "behind-the-meter power generation",
      "natural gas turbine generation",
      "battery storage systems",
      "voltage distribution and control equipment (HVMVLV acquisition)",
      "balance-of-plant equipment",
      "molecule-to-electron integration"
    ],
    "completions_strategy": "No completions strategy; Solaris has fully pivoted from oilfield services toward power infrastructure for data centers. Legacy Logistics Solutions segment (proppant/last-mile) still contributes $80M+ free cash flow but is no longer the growth focus.",
    "service_provider_mentions": [
      "Stateline Power LLC (JV for 900 MW AI data center)",
      "HVMVLV (acquired)"
    ],
    "efficiency_metrics": "Q4 2025 revenue $180M (up 8% sequentially). FY2025 revenue ~$622M (up 99% YoY). Adjusted EBITDA $71M in Q4. ~780 MW deployed. Logistics segment $80M+ free cash flow in 2025. At 2,200 MW target: $700M-$750M consolidated EBITDA projected.",
    "seismos_relevance": "Low",
    "seismos_relevance_reason": "Solaris has effectively exited the completions-adjacent oilfield services space and is now focused on power generation for AI data centers. No mentions of frac technology, completions, or well optimization. Their legacy logistics business is in wind-down mode relative to the power pivot.",
    "notable_quote": "The four largest global technology companies have recently guided to combined capital expenditures exceeding $600 billion in 2026, roughly a 70% increase from 2025 levels.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "SHEL",
    "company": "Shell plc",
    "segment": "Major",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "Shell delivered $5.1B in structural cost reductions by end-2025 (three years ahead of deadline), with 60% from operational efficiencies, while reporting $18.5B adjusted earnings and $26B+ free cash flow despite lower oil prices. Management committed to 17 consecutive quarters of $3B+ buybacks and a 4% dividend increase, while pursuing LNG growth (11% sales increase) and deepwater expansions in GoM, Brazil, and Nigeria. CEO cited AI as a key near-term opportunity for further performance improvement.",
    "capex_guidance": "$20-22B cash CapEx maintained; >1 MMboe/d peak production additions by 2030",
    "basin_focus": "Gulf of Mexico (Kaikias waterflood FID, deepwater), Brazil (Gato do Mato/Orca FID), Nigeria (deepwater), LNG Canada, North Sea (Adura JV)",
    "technology_mentions": "AI mentioned as key opportunity for further performance improvement; operational efficiencies driving cost reductions; no specific completions technology cited",
    "completions_strategy": "Focus on deepwater and LNG; North Sea conventional; no shale completions detail provided",
    "service_provider_mentions": "Pavilion Energy (LNG acquisition); Adura JV with Equinor; no completions vendors named",
    "metrics_reported": "FY2025 adjusted earnings $18.5B; CFFO ~$43B; FCF >$26B; structural cost reductions $5.1B cumulative; LNG sales +11%; reserves life ~7.8 years",
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "Shell is predominantly an offshore and LNG major with minimal U.S. unconventional shale completions activity. No frac diagnostics, CLF, acoustic sensing, or completions technology mentioned. Not a near-term Seismos target customer.",
    "notable_quote": "We entered 2026 as a more resilient organization with lower costs"
  },
  {
    "ticker": "TTE",
    "company": "TotalEnergies SE",
    "segment": "Major",
    "quarter": "Q4 2025",
    "strategy_summary": "TotalEnergies is pursuing integrated energy growth across oil, gas, and electricity, targeting 5% total energy production growth and 3% oil/gas production growth in 2026. The company is implementing a $12.5B cash-savings plan over 2026-2030 while maintaining upstream costs below $5/boe and achieving the best ROACE among majors for four consecutive years.",
    "capex_guidance": "~$15B net investments (including ~$3B low-carbon, ~$4B with EPH equivalent)",
    "production_guidance": "Oil & gas production growth of 3% in 2026; total energy production growth of 5%",
    "basin_focus": [
      "Eagle Ford",
      "Anadarko Basin",
      "Global deepwater",
      "Middle East",
      "LNG"
    ],
    "technology_mentions": [],
    "completions_strategy": "No specific completions or frac technology discussed. US shale activities mentioned only at portfolio level (Eagle Ford interests, Anadarko Basin gas acquisition). Focus is on major project startups (Ballymore US GoM, Mero-4 Brazil, Rio Grande LNG) rather than shale completions optimization. Noted US shale oil production is sensitive to oil price with limited non-OPEC growth expected from 2027.",
    "service_provider_mentions": [],
    "efficiency_metrics": "Upstream production costs maintained below $5/boe. ROACE 12.6%, best among majors for 4th consecutive year. Cash flow $27.8B on $15.6B adjusted net income. Downstream operating income up 26% in Q4. Targeting $2.5B in savings for 2026 as part of $12.5B 2026-2030 plan.",
    "seismos_relevance": "Low",
    "seismos_relevance_reason": "Supermajor with diversified global portfolio. No discussion of completions technology, frac optimization, or real-time monitoring for US shale operations. Focus is on mega-project startups, LNG, and integrated power rather than completions efficiency. US shale is a small part of overall portfolio.",
    "notable_quote": "Return on average capital employed stood at 12.6%, the best among the majors for the fourth consecutive year.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "VIST",
    "company": "Gladstone Land Corporation (FILE MISMATCH - expected Vista Energy)",
    "segment": "N/A - Wrong company in file",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "FILE MISMATCH: VIST.txt contains the Gladstone Land Corporation (NASDAQ: LAND) Q4 2025 earnings call transcript, a farmland REIT with no oilfield operations. Vista Energy (VIST) transcript was not found in this file. No competitive intelligence applicable to Seismos.",
    "capex_guidance": "N/A",
    "basin_focus": "N/A - Farmland REIT",
    "technology_mentions": "N/A",
    "completions_strategy": "N/A",
    "service_provider_mentions": "N/A",
    "metrics_reported": "N/A",
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "Wrong company loaded in this file. Gladstone Land is a farmland REIT with zero relevance to Seismos oilfield technology.",
    "notable_quote": "N/A - wrong company in file"
  },
  {
    "ticker": "WHD",
    "company": "Cactus, Inc.",
    "segment": "OFS-Equipment",
    "quarter": "Q4 2025",
    "strategy_summary": "Cactus finished 2025 with $261M revenue and 32.7% adjusted EBITDA margins. The transformative event was closing the $344.5M acquisition of 65% of Baker Hughes's Surface Pressure Control business (Cactus International) on Jan 1, 2026, providing immediate international scale with a $550M backlog. The company is pursuing geographic diversification into Middle East, Sub-Saharan Africa, and Far East markets.",
    "capex_guidance": "$40M-$50M net capex for 2026 including Cactus International investments",
    "production_guidance": "N/A",
    "basin_focus": [
      "U.S. Land",
      "Middle East",
      "Sub-Saharan Africa",
      "Far East"
    ],
    "technology_mentions": [
      "Spoolable Technologies",
      "Pressure Control",
      "new SKUs in Spoolable Technologies",
      "pilot programs Middle East"
    ],
    "completions_strategy": "Indirect completions exposure through wellhead and pressure control equipment used during completions operations. Spoolable Technologies segment provides composite pipes used in production. No direct frac monitoring or diagnostics technology.",
    "service_provider_mentions": [
      "Baker Hughes"
    ],
    "efficiency_metrics": "32.7% adjusted EBITDA margin; Pressure Control margins up 90bps sequentially; cash balance $495M; $10M annualized synergy target from Cactus International within year one",
    "seismos_relevance": "Low",
    "seismos_relevance_reason": "Wellhead/pressure control equipment and spoolable pipe manufacturer. No completions technology, frac diagnostics, or real-time monitoring overlap with Seismos CLF capabilities.",
    "notable_quote": "I am pleased with the way our business finished the year in 2025. Fourth quarter margins were strong in both segments.",
    "data_quality": "Search summary"
  },
  {
    "ticker": "XOM",
    "company": "ExxonMobil",
    "segment": "E&P Operator — Supermajor",
    "quarter": "Q4 2025",
    "transcript_url": "MarketBeat highlights summary",
    "strategy_summary": "ExxonMobil delivered record Permian production of 1.8M BOE/d in Q4 and 4.7M BOE/d company-wide. Lightweight proppant deployed in 25% of wells with target of 50%. 40+ stackable technologies in testing and deployment across the Permian. Cube development focus. Enterprise ERP/AI overhaul underway to enable broader data-driven decision making. Data center and CCS conversations emerging.",
    "capex_guidance": "Not specified in summary; Permian targeting 200 kboe/d annual production growth",
    "basin_focus": [
      "Permian Basin (primary, record 1.8M BOE/d)",
      "Gulf of Mexico",
      "Guyana",
      "International"
    ],
    "technology_mentions": [
      "Lightweight proppant (deployed in 25% of Permian wells, targeting 50%)",
      "40+ stackable completion/drilling technologies in testing and deployment",
      "Cube development (co-development of multiple landing zones)",
      "Enterprise ERP overhaul for AI adoption",
      "Data center partnerships (emerging)",
      "Carbon capture and storage (Stratos equivalent context)"
    ],
    "completions_strategy": "ExxonMobil's Permian completions focus is on cube development and stackable technology deployment (40+ technologies across proppant, fluid, stage design, lateral length). Lightweight proppant is the most specific technology cited. Scale of operations (1.8M BOE/d Permian) means even incremental efficiency gains from better completions diagnostics would be commercially significant. No CLF, acoustic, or real-time frac diagnostics mentioned.",
    "service_provider_mentions": [
      "Implied: major completion service providers (Halliburton, SLB, BKR)"
    ],
    "metrics_reported": {
      "Q4_Permian_production": "1.8M BOE/d (record)",
      "company_production": "4.7M BOE/d",
      "lightweight_proppant_adoption": "25% of wells (targeting 50%)",
      "stackable_technologies": "40+",
      "permian_annual_growth_target": "200 kboe/d"
    },
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "ExxonMobil's scale and 40+ technology portfolio suggest they are active completion technology experimenters. Lightweight proppant adoption curve (25% to 50%) shows a methodical A/B testing approach that Seismos could pitch into. However, XOM's supermajor procurement processes, long vendor qualification timelines, and reliance on integrated major OFS providers make direct Seismos engagement complex. The 'stackable technologies' framing is useful positioning context — Seismos could pitch SAFA as a stackable diagnostic layer. No near-term commercial signal.",
    "notable_quote": "We have more than 40 stackable technologies in testing and active deployment in the Permian, including lightweight proppant now in 25% of our wells with a path to 50%."
  },
  {
    "ticker": "XPRO",
    "company": "Expro Group Holdings",
    "segment": "OFS - Completions/Well Services (International/Offshore)",
    "quarter": "Q4 2025",
    "transcript_url": "local",
    "strategy_summary": "Expro delivered $1.6B revenue and 22% EBITDA margins in 2025, driven by international/offshore completions, well flow management, and subsea services - with free cash flow more than doubling to $127M. Strategy focuses on expanding wallet share through technology cross-selling (Coretrax acquisition now deployed in 31 countries), margin expansion via DRIVE25 cost initiative, and targeted M&A. Secured a landmark 4-year $380M North Africa production optimization contract.",
    "capex_guidance": "2026 CapEx similar to 2025 levels; EBITDA guidance $365M midpoint with margin expansion target toward 25%",
    "basin_focus": "International offshore: MENA (39% EBITDA margin), North/Latin America, Europe/SSA, Asia Pacific; deepwater globally",
    "technology_mentions": "XRD Spider (1,250-ton drilling spider, first of kind), CaTS ATX (real-time wireless downhole data + remote valve control during DST), Cure Technologies (cement cure time reduction, saves ~24 hrs rig time), Coretrax tubular running and well construction tools, digital and subsea solutions",
    "completions_strategy": "Full well lifecycle model: well construction (TRS + cementation + Coretrax tools), well flow management (testing/sampling/DST), subsea well access, and well intervention/production optimization. Cross-selling incremental services to existing rig crews to expand wallet share.",
    "service_provider_mentions": "Coretrax (acquired 2024, now in 31 countries); Caterpillar Financial Services (financing); Stonebriar Commercial Finance",
    "metrics_reported": "Revenue: $1.6B FY2025; EBITDA: $353M (22% margin); FCF: $127M (>2x prior year); Backlog: $2.5B (+$196M in Q4); Q4 MENA EBITDA margin: 39%; NLA Q4 revenue: $130M; ESSA Q4: $116M",
    "seismos_relevance": "Low",
    "seismos_relevance_detail": "Expro is an international/offshore OFS company focused on well testing, flow management, and subsea - not a North American pressure pumping or frac diagnostics player. No mentions of hydraulic fracturing completions, CLF, or real-time frac diagnostics. Expro's CaTS ATX downhole telemetry system is a distant technological cousin but serves a different application (DST vs. frac monitoring). No competitive or partnership overlap with Seismos.",
    "notable_quote": "CaTS ATX enabled real-time wireless downhole data during drill stem testing in Indonesia"
  },
  {
    "ticker": "YPF",
    "company": "YPF Sociedad Anonima",
    "segment": "International",
    "quarter": "Q4 2025",
    "strategy_summary": "YPF reported Q4 2025 results on February 27, 2026, posting a net EPS loss of -$1.67 vs. $0.59 consensus estimate (missed by 383%), with higher EBITDA offset by softer output and prices. The company is executing its 4x4 plan to become a pure-shale operator in Vaca Muerta, divesting 49 mature conventional blocks and targeting shale oil production of ~215,000 bbl/d in 2026 and ~290,000 bbl/d by 2027. Argentina LNG FID was expected in Q1 2026 with Eni and ADNOC as partners.",
    "capex_guidance": "$5.2 billion for 2025 (with Brent at $72/bbl); ~70% directed to unconventional/shale. Management noted Q4 2025 capex came in slightly below full-year guidance. 2026 capex expected to remain elevated to support VMOS pipeline and shale ramp.",
    "production_guidance": "2025 shale oil target ~190,000 bbl/d (exit rate); 2026 target ~215,000-250,000 bbl/d; 2027 target ~290,000 bbl/d. October 2025 preliminary production reached all-time high of 190,000 bbl/d. Q4 2025 results showed softer-than-expected output per headline reporting.",
    "basin_focus": [
      "Vaca Muerta (Neuquen Basin, Argentina)"
    ],
    "technology_mentions": [
      "Longest well in Vaca Muerta history (8,200m total, ~5,000m lateral at Loma Campana)",
      "Record drilling speed: 331 m/day average, 360 m/day annual target",
      "259 frac stages per set per month (target 260)",
      "Solvent-assisted completions tested",
      "VMOS oil pipeline (180,000 bbl/d Phase 1, Q3-Q4 2026)"
    ],
    "completions_strategy": "Aggressive stage count optimization with 259 frac stages per set per month, approaching annual target of 260. Drilled record 4,000m horizontal well in 15 days at La Malga Chica. Completions activity represents majority of unconventional investment. Service cost negotiations with providers ongoing to reduce unit costs. No specific CLF or real-time frac monitoring technology mentioned.",
    "service_provider_mentions": [
      "No specific service providers named; management noted active negotiations with service companies to reduce unit costs"
    ],
    "efficiency_metrics": "Lifting cost reduced 28% QoQ and 45% YoY in Q3 2025 to ~$9/boe; target of $5/boe. Drilling speed 331 m/day. Frac: 259 stages per set per month. Shale oil production +55% vs 2023 levels as of Q3 2025.",
    "seismos_relevance": "Low",
    "seismos_relevance_reason": "YPF's earnings calls focus on drilling speed, stage count, and lifting cost metrics but do not mention CLF, acoustic/seismic frac monitoring, or real-time frac diagnostics. Vaca Muerta completions are high volume but discussed in aggregate efficiency terms without specific diagnostic technology callouts.",
    "notable_quote": "CEO Horacio Marin: 'You have to expect 2026 a very clean year of the results.' YPF also stated it 'nearly tripled oil export revenues' and is confident in achieving 180,000 bbl/d target by Q4 2026.",
    "data_quality": "Search summary"
  }
]